[
  {
    "text": "someone mowed their lawn",
    "author": "Steamhalte",
    "date": "2025-10-31"
  },
  {
    "text": "Probably the perfect work perfume. The opening prepares you for a bright, bitter morning, while the dry down is comforting and personal towards the end of the day. It smells sharp and cognitive, gentle and polite at the same time. It's a memorable, unique fragrance that doesn't smell anonymous like a lot of other perfumes recommended for work. My boyfriend thinks it smells exactly like cut ivy; I think the green colour perfectly represents its smell.",
    "author": "violetsforyourfurs",
    "date": "2025-10-26"
  },
  {
    "text": "Chanel N19 EDP hits me sharp and peppery before settling into iris: dry, a bit oily-creamy, almost like cold lipstick pressed against stone. It’s sharp but elegant, with moss cutting through, very dry and chalky, like clean dust on stone. It feels sculptural, cool, even a little severe. It is iris, moss, resins and woods stripped of any sweetness. Even that peppery bite adds to that icy atmosphere. Oddly, it’s comforting in how serious and unsentimental it is.",
    "author": "FlaconNoir",
    "date": "2025-09-04"
  },
  {
    "text": "This definitely has the strong characteristic DNA of Chanel - very earthy, patchouli-like, and green. This opens dirty, like unwashed vegetables, and stays that way. An acquired taste.",
    "author": "Liddywinnie",
    "date": "2025-08-19"
  },
  {
    "text": "What a shame! Chanel how dare you to ask that much money for scented water in the nowadays version. Today i have tested this Chanel no19 at Ici Paris. It was the eau de parfum. Exactly after 10 minutes of applying the parfum was completely gone on my wrist. Nothing to smell. I have had the same experience with the nowadays version of no.5. In my opinion you can better buy a dupe of these parfums. They are much cheaper and probably much more long lasting. Chanel is probably thinking our name sells itself so we can weaken all the parfums more and more. I just can't believe such a marketing. Big big shame on you Chanel. 🤮The perfume blast in the beginning is very nice and very green thats all. Ten minutes of smell voor €150.",
    "author": "Dollycat",
    "date": "2025-08-10"
  },
  {
    "text": "I had a bizarre experience sampling this - I wore Chanel No. 19 on one arm and Chanel Chance Splendide on the other. And the contrast was... unsettling. No. 19 was so grounding and transcendental. Splendide, by comparison, felt so banal it made me wince. I’ve tested No. 19 before, but this time I gave it my full attention. I slowed down and let it unfold, every nuance. It’s green and soapy, yes, but that doesn’t begin to capture the energy it holds. It’s cool but not cold. Detached, but not indifferent. This is a scent that doesn’t chase trends. There’s something Chanel does when it’s at its best: it creates a feeling of absolute self-possession. No. 19 has that in spades, it doesn’t flirt, and it doesn’t beg to be liked. It's classic, composed, and full of depth. In that strange comparison with Chance Splendide, it felt like two entirely different brands. No. 19 reminded me why I believe in Chanel in the first place.",
    "author": "MetaMystic",
    "date": "2025-07-22"
  },
  {
    "text": "another surprise in my collection! now I have been thinking about the age of this particular bottle. it can be at least ten years old, but in the same stride twenty. I remember it well from 1974. perhaps many people think 'how does he come so precisely with 1974 ?'. well in march 1975 we (my twinbrother and me) started with the study (= working) of Nurse. in fact we started in aug.1974 as Aids in the Ward's Kitchen for half a year. so I really see myself in that particular perfumery sniffing the then important perfumes. I guess there was still a little Staid athmosphere. what I remember of No19 is that it was there in Eau de toilette and in Parfum. and I just braced myself for a Bitter and Countering Opening. I could have sworn there would be Galbanum in it. I just saw it is a Note in the 'Perfume'. here we have the famous 'Green Notes'. where it now may seem that I am not satisfied about the perfume (i.e. Edp) I may have used the wrong words. I find this a beautiful perfume and am amazed how well-blended it is and how it then still succeeds to have the austere opening. in fact there is a kind of 'institutionalized' austerity which is, after all, the Hallmark of No19. and all the Chypres of this era. with my perfume I am struck on how facetted and wonderfully striated it is, this all in Glissements and Fluidums. perhaps there is the Green Phase (the Opening) with [quasi-] Galbanum then Green Notes, the Bergamot must do a Freshening-Up (Fresh-Up the most revolting and dreaded product of male cosmetics) but alas I do never smell individual Citruses only in Colognes which are not my cup of tea entirely. but Hesperidic and Incisively Green it is, the opening, also with Neroli Flowers. then we get a phantastic Middle phase. (I already noted the perfume lasts for hours.) it is all Lovely Flowers, notably Iris, Rose, Narcissus, Lily of the Valley and Ylang-Ylang. these phases do not clash with each other, because of the quality ingredients their botanical and aromachemical features all seem to usurpate each other where in the Middle Phase the Flowers just arrive and the more fleeting Green Notes are (not entirely) disappearing. Henri Robert was the originator of the 1971 Chanel No19 and it is my guess either Jacques and or Son Olivier Polge took care of the following editions. the base notes are all sturdy and grounding this Chypre in Leather, Oakmoss, Sandelwood and Vetiver. it is the Woody Backbone with typical Chanelissime. yet I am compelled to judge this perfume as a whole, as it has just become that in my collection. a Supremely Blended, Exquisitely Present perfume for those who want to maintain personal space and Chicness.",
    "author": "jaguarundina",
    "date": "2025-07-11"
  },
  {
    "text": "The perfume which I can't match. It has its own character. The top of the perfume is dry, green, almost bitter. Iris consumes it after a while and the floral heart is more polite but there is a wildreness still. With mossy base, earthy and leather, it provokes. It is disturbing - for me, this scent isn't meditative, calm or natural. I found it bold and sharp, although it has a vintage spirit. Clearly it is a legend-loved or hated, but never indifferent... --- Strong projection, amazing longevity (8 hours and still very fresh...).",
    "author": "Shui-Xian",
    "date": "2025-07-01"
  },
  {
    "text": "Such in interesting fragrance. On first spray, I got the classic Chanel dna, which somewhat reminded me of my vintage No 5 Eau de Cologne. Yet, it takes a different turn. Ronin. Jones’ review is pretty spot on! I get a classic vibe from this. It evokes a memory that I can’t place. Perhaps someone I knew many many years ago wore this. It’s beautiful in a slightly vintage way however it doesn’t necessarily smell dated. Past the opening, I actually don’t find this all that green, as it settles into a warm woody base with a touch of freshness. Eight hours later it is so beautiful ! Great for all seasons and occasions.",
    "author": "Ismellgood2024",
    "date": "2025-06-25"
  },
  {
    "text": "that opening of the starchy rooty iris and the bitter, stemy, vegetal greeness of the galbanum is really interesting. which then reveals a chypre core as it settles down. consisting of dewy, fresh and silky complex melange of florals, a soft oakmossy base, with a little squeeze of citrus to brighten everything. its well-blended, clean, soft, powdery, a bit soapy, but never sharp. i dont find it aloof and cold as others describe it. i find it easy to wear and approachable. like a very warm and friendly wealthy middle aged woman. that mid and drydown is honestly underwhelming. the mix of the florals and citrus reminds me of a body lotion or a face cream the longer it stays on my skin. i need something more earthy and bitter",
    "author": "ronin.jose",
    "date": "2025-06-24"
  },
  {
    "text": "This and No.19 Poudré is what I imagine Heaven smells like. Green floral with a gorgeous woody base that melds with your skin. There's aldehydes, but I think it's just Chanels base or DNA. I discovered this when Chanel still made tiny 5ml bottles and sold them in places like K-Mart (remember them?). I was like 15 and didn't want to be seen with my mom shopping so I went to the jewelry department and they kept them in a turning glass tower. Chanel meant fancy, lol, so I bought it. I don't think it's an exaggeration to say I fell in love. This is green to me, but the woody base is what woody bases should smell like, not the screechy messes we have in today's fragrances. Chanel has done an amazing job of hanging on to its identity. This won't please a lot of people today, it's not easy, sweet or trendy but it's perfume in a time when a house perfumer just throws vanilla in a base and calls it a day.",
    "author": "Clws",
    "date": "2025-06-20"
  },
  {
    "text": "My Mum's signature perfume since I was a kid. On her it smells very warm and elegant. Reading the notes I'm surprised that the top notes are green, which makes sense, but on my mother's skin chemistry it dries down into a scent that makes me think of white (the colour she wears the most) amber, and clean, expensive warm clothing. Never sharp or heavy. I don't think of the scent of old fashioned (like some of the reviews mention) but it's definitely a woman's perfume. I myself wouldn't try wearing it until I'm a bit older and wiser lol. It smells good on me also, but I just get the impression I can't carry it yet.",
    "author": "kiki-alice",
    "date": "2025-06-08"
  },
  {
    "text": "Today I get play one of my favorite games: a multi format vintage vs. new comparison. The beautiful lady walking arm-in-arm with me today is none other than No. 19. On the back of my left hand and that wrist is an EdC from probably the late 1970s/early 80s, on the upper part of that arm is a new EdP, and on my right hand and arm is an extrait from the early 1990s. Sometimes I feel like the luckiest guy in the world. Curiously, No. 19 doesn't get much love, in fact it seems to get quite a bit of hate. I've heard some people say that if No. 19 was a woman, she would be a frigid \"b\" with no friends. Though I understand what they're saying, I think that's overly harsh and a classic case of being misunderstood. To me this character is more prim and proper rather than cold and mean; it's the difference between us loud and brash Americans versus British royalty, let's say: just because the Brit royalty is typical stiff-upper-lip and very proper doesn't make them cold and mean. This difference of character perception can also be seen across the formats and vintages I'm wearing today. Take my very old EdC vs. the new EdP as an example: though age has most assuredly tempered Ms. 19 in the EdC format, that hyper green claw-like galbanum top note is far smoother and well-rounded in the EdC than the EdP. The EdP is claws out, right from the get-go, and, as you would expect, those claws stay out for longer. Rather quickly, the EdC dries down to a very pleasant and soft powdery woody floral chock full of iris, lily, sandalwood, and oakmoss (real oakmoss - have I mentioned how much I love opportunities to smell real oakmoss?) - making this the easiest of the No. 19s to wear, and that's really the whole story of the EdC beyond this point. The EdC is desperately pretty, calm, and friendly after the last dry down and for the few hours beyond. After about an hour after application, the EdP's claws are still out but they've been filed down, and it's definitely more apparent that the use of synthetics is more prominent in this new EdP versus the old EdC. This is as you would expect, but I must emphasize that the \"synthetic\" quality of the EdP is more than you would expect. Now, I have a different frame of reference here because I'm smelling a very old EdC side-by-side with the new EdP, so don't take my comments to mean that the new EdP has an offputting fake quality to it, because it still smells amazing; if you don't have an old formulation to compare it to, you are likely not going to notice the synthetics much. The filed-down claws of the EdP that I mentioned are no longer in the form of a sharp green galbanum, but vivid, saturated, thorny florals. The EdP is all about the heart notes of rose, a rooty iris, jasmine, lily, and ylang ylang - but, again, be careful when you go in for a sniff or you reach your hand into that bouquet because there are thorns there. These aren't gentle florals by any means; they aren't going to actively scratch you, but they are fully capable of defending themselves if needed. Ms. 19 is no longer in fight-or-flight mode, but she still has her guard up. Those ylang-ylang and jasmine notes in the EdP are a tour de force team, all vivid and saturated colors of white, green, and yellow. But what about the extrait?! Yes, I know you want to know what the extrait is doing. Frankly, I'm at a loss for words with the extrait, but I shall try. It is just so, so, so good. Absolutely stunning. The extrait opened with the same hyper green galbanum note of the others - the EdP more specifically - but the galbanum is not claws-out like it is in the EdP. There are no claws here. The galbanum's personality is softened and gentrified by some of the most beautiful jasmine, iris, ylang-ylang and rose notes you will ever smell. Every note of the EdP (and EdC for that matter) are presented and accounted for in the extrait, but if I were to rate the materials/accords on realism, quality, and execution, the extrait would be 10 out of 10 while the EdP and EdC make do at 6. I love the EdC and the EdP, so this should hopefully place in understandable context just how good I think the extrait is. While the EdC and the EdP are playing around, drying down and doing there thing, at nearly three hours in the extrait is only just warming up. Remember what I said about No. 19 being prim and proper and not cold and mean? Picture then a beautiful, regal, proud and strong woman in the finest handmade dress and you have the extrait. Monica Belucci in Valentino, basically; the extrait smells the way she looks. It will be a couple hours more even at this point before the extrait begins moving, after the EdC and the EdP have mostly worn themselves out. One curiosity to definitely note, and it should also be mentioned it's quite a hot day here in my part of California, the bergamot and neroli of the extrait have a far greater voice on the blotter than they do on my skin. The same could be said for the EdP as well, but the voices of the bergamot and neroli of the extrait are still greater than that of EdP's. We're going to fast forward to the end of the day, many hours later. The EdC is long gone, the EdP is a very pleasant skin scent of soft sandalwoods and much more pronounced notes of vetiver and animalic musks than the EdC. And the extrait... it's still there. While I'm worn out from an afternoon of running around, this lovely lady on my arm is still there, energized, and ready for an evening soiree. The galbanum and florals are gone, but the vetiver, woods, and mosses are still going. Partly why the extrait is my favorite of the No. 19 formats is because Chanel have made it act like a proper extrait should. While the EdC and EdP tire themselves out in hours, launching themselves into the air and drying-down like they're in a race (a bit exaggerated, but you get my point), the extrait stays close to you. Very close. Insanely powerful, but close. That measured approach to its energy and output, like a real extrait in the classical style should be, is exemplary to the personality I find in Ms. No. 19. She's not cold and mean, she's elegant, proud, strong, and confident - with you for the long haul, so to speak. Those are my favorite kinds of people. And that's why No. 19 is very likely my favorite Chanel perfume.",
    "author": "Nathan86",
    "date": "2025-05-31"
  },
  {
    "text": "You could pay me money, and I still would not wear this. It smells like a gas station bathroom to me. Nothing fresh about it, nothing truly green. Maybe rotten plants or somethjng but that’s as far as it goes. Try something from Emil Elise, Kenzo or Marc jacobs daisy line if you want somethjng truly fresh and vibrant green 🌿🌱",
    "author": "Yila",
    "date": "2025-05-25"
  },
  {
    "text": "Love love love! I don’t understand why aldehydes aren’t listed in the scent profile. They are the most prominent note. Chanel 19 is like if Chanel 5 gave birth to itself in the woods… it rolled around in the leaves and mossy forest floor. I’m a huge fan of Chanel 5, it’s my signature fragrance. And I’ve worn it for almost 30 years with a little break for some time when I didn’t wear anything while working in the health field. But I’m back! I bought Chanel 19 on a blind buy. I really love all Chanel fragrances and they are, by far, my favorite house. I assumed I’d like 19 and took a chance. I’m so glad I did. Sometimes, Chanel 5 feels heavy and, on those days, I will now wear 19 as it’s a bit lighter. It is quite reminiscent of 5. It’s milder, but still the powdery aroma I love about 5. The green notes are very nice. Upon spritzing, I do smell that vintage lipstick scent that other people have mentioned and I really like it. It’s like powdery lipstick and earth. My Chanel loves are 5, Coco Noir, and now 19. These are the ones I currently own. I do love Edimbourg, but haven’t made the plunge as it’s too light and I can barely smell it on myself without putting my wrist up to my nose. And I do enjoy all the others, especially Allure, Chance Eau Splendide, Coco Mademoiselle and Coco on paper. I haven’t skin tested them yet, but have samples I plan to use. If you like aldehydes, Chanel 5, or vintage scents, you will likely love 19.",
    "author": "LaBohemeFemme",
    "date": "2025-05-22"
  },
  {
    "text": "This is my favourite scent. I’ve used it since 2008. The only thing I don’t like about is I go nose blind if I wear it every day, so I don’t get to enjoy it! Whenever I’ve not worn it for a week or more, it’s such a treat because I get whiffs of fragrance all day.",
    "author": "Amonik",
    "date": "2025-05-20"
  },
  {
    "text": "Chanel No. 19 Eau de Parfum is a green floral chypre that dares to stand apart in a world of warm and sensual perfumes. Launched in 1970 and named after Coco Chanel’s birthday, this fragrance is composed with striking confidence: a bold opening of galbanum and neroli, layered over an elegant heart of iris and rose, and resting on a refined base of vetiver, oakmoss, and leather. Its accord is uncompromisingly green and cold, aloof, almost emotionally detached yet impeccably refined. Truthfully, what I feel from this fragrance is precisely the absence of feeling; it’s a scent that wears like a porcelain mask: distant but dignified, cold but elegant not harsh, just icy in temperament. I had longed to own this scent since childhood, mesmerized by the serene green hue of its juice, yet it was never available in my home country nor in the Chanel boutiques I visited during my early travels in my childhood. Over time, I came to realize this perfume is not made for the taste of today’s youthful, modern women, and it lacks the sugar-coated femininity they often favor, and is rarely seen compared to other Chanel scents. Still, despite its emotional frostiness, I love this perfume deeply, perhaps not for what it is, but for what it meant to me as a child. Its sillage and longevity are moderate, neither overwhelming nor fleeting. And although I cherish it, I can admit there are greener, more evocative fragrances available. If not for my nostalgic connection, I might have chosen differently. Ultimately, Chanel No. 19 belongs in formal settings and the perfect companion to quiet strength and intellectual elegance. I’d rate it 6.4 out of 10.",
    "author": "Behrad",
    "date": "2025-05-11"
  },
  {
    "text": "When I was younger, many of the current Chanel fragrances had not yet appeared. I was hesitant to wear Chanel No. 5, I thought that the wearer of this fragrance needs to grow up to perceive it correctly. The very first fragrance from Chanel, which I immediately accepted and which still remains one of my favorites is Cristalle Eau de Parfum Chanel by designer Jacques Polge. I was lucky to meet a charming girl from Bordeaux one day, we were young carefree students, having a great time together. It was she who advised me to start getting to know the Chanel No. 19 fragrance. I must say honestly that I didn’t perceive the first bottle as anything special, but the more often I used No. 19, the more I liked it. I get a lot of compliments when I wear No.19. The scent is infinitely romantic and beautiful. I like it at any time of the day or night, in any season of the year. I try to use it in special situations so that it remains for me not an everyday routine, but a constant \"holiday that is always with you.\"",
    "author": "Gemilina",
    "date": "2025-05-09"
  },
  {
    "text": "Married my Sweetheart 38 years ago wearing this- and he's still my Sweetheart. No. 19 is still as classy, timeless, elegant and as chic as ever. I adore it like no other.",
    "author": "lisl",
    "date": "2025-03-25"
  },
  {
    "text": "I found this to be extremely unpleasant and old fashioned. If someone was near me and wearing this, I would hope the projection is not strong, otherwise I would need to move away. It was one of the most unpleasant fragrances I've encountered. It had a pungent, strong green smell, not a pleasant green, but overwhelming, like you'd never be able to wash it off. That said, I did not like any of the Chanel perfumes in the boutique. While they each smell different, you can tell they are from the same \"family.\" I was hoping to like 19 because I've read on a forum, a few people say they like it. I guess either you like Chanel perfumes or you don't. They just aren't for me.",
    "author": "Wednesday5",
    "date": "2025-03-23"
  },
  {
    "text": "At first spray I was blown away, it's a world away from the heavy vintage of Chanel 5, but so distinct. The top notes are wonderful, bitter green and woody, almost masculine and clinical, but still elegant. It dries down a bit more generic, floral and a tinge soapy, but without feeling overly mature.",
    "author": "Glassfury",
    "date": "2025-03-06"
  },
  {
    "text": "Not a bad fragrance but definitely not for me. As a guy I knew going into it that being a women’s fragrance it might be too feminine for me but I figured I’d try it out anyways because I love the notes listed, however to me this is what you would gift your mom for Christmas. It smells fresh and green and sophisticated and has that classic Chanel scent, but it is very “mature” and very feminine. I also found this to be very powdery which I think balances out any “sharp” green notes and overall it’s very lovely, but again I think this is something you’d gift your mom or mother in law .",
    "author": "Jrf18",
    "date": "2025-02-17"
  },
  {
    "text": "The most elegant and unique parfum in the designer world. petrichor....",
    "author": "elisa.fuentes.1",
    "date": "2025-02-12"
  },
  {
    "text": "I’m quite surprised by the longevity—it’s not holding up at all. Maybe an hour, and even then, it stays really close to the skin. Disappointing.",
    "author": "MariPaliienko",
    "date": "2025-02-10"
  },
  {
    "text": "I'm just gonna say it. I'm sorry and I do not like it. Very disappointed as I blind bought a full bottle. Dry down is so overwhelmingly powdery and muddy. Can barely pick up any of the notes besides green and powder. I would agree that it is elegant, reminds me of a green velvet dress in a way. It would be good to wear to something formal like a night time company event. Its very old smelling though, what I imagine women wore in the 40/50s. I will probably offer this up to my grandma, she would like it. Not good for a young woman. I am really sad about this one since the reviews made it really seem like my type of scent. Perhaps I got a bad batch or a fake one.",
    "author": "bangtansonyeondani",
    "date": "2025-02-04"
  },
  {
    "text": "My all time favourite, so elegant.",
    "author": "elisa.fuentes.1",
    "date": "2025-01-20"
  },
  {
    "text": "massimilianoinquieto12/02/24 09:55 Chanel 19 no longer has anything in common with what it was in the 70s, 80s, 90s. It cannot be said that it has been reformulated but rather changed. In the comparison there is nothing that unites them, they are just two different perfumes. The current one is also good but has nothing to do with the original Chanel 19. If a perfume was based on oakmoss, narcissus, lily of the valley, orris root, sandalwood, vetiver and galbanum, most of these natural oils were banned. Lily of the valley prohibited, oakmoss prohibited, narcissus with what it would cost to distil that flower or even just its rhizome, they don't put it there, leather feels very synthetic and strange, that is, there is nothing that resembles it anymore. The real Chanel 19 was cold, severe, masculine, reminiscent of a melancholy day with a cold, rainy sky, but in being so severe it was also comforting. I still have it so I can compare and of course I prefer vintage. The older it is, the better it is. The one now is very far away, a soapy fragrance with a touch of yellow lemon initially, much more frivolous and cheerful, it seems transparent yellow, dusty. I also find it rather strange in smell. The first note is too strange and does not conform to what it was in its original. Here the notes are felt too distinctly and it was certainly not in Chanel's perspective which instead wanted to create fragrances where the ingredients could not be smelled, like Chanel n5. Even if after a while it tends to become more \"human\" and is covered with yellow flowers, otherwise it is a pleasant perfume but far from what it was in its origins.",
    "author": "swedishmilk15",
    "date": "2025-01-19"
  },
  {
    "text": "@Massimilliano, I think you meant to post that on fragrantica.it",
    "author": "genevieves",
    "date": "2024-12-27"
  },
  {
    "text": "This review relates to the modern EDP. A gorgeous green woodsy scent, but disappointing longevity for such a price. Scarcely 3 hours on the skin for an eau de parfum, and even so, that initial, beautiful blast of green notes dry down into a far too intimate skin scent an hour or so in. Occasionally they'll be a little waft of that initial brilliance beyond an hour, but only if caught on your sleeve. Was it a bad batch? Apparently not, according to other underwhelmed reviewers of the modern incarnation. I adore the scent itself. Remarkably unisex to a modern nose, despite its waspy, ladylike connotations for some. It has a particular glamour of its own, one really quite hard to define. Perhaps indictive of the shifting cultural landscape of its early 70s inception, it rests somewhere between a put-together old aunt in a twinset and pearls and her carefree niece who likes a batwing sleeve. Next time I'll buy vintage for the longevity or see if I can secure a sample of the modern pure parfum. Quite disappointed in Chanel. One of the few designer brands I usually trust when it comes to balancing quality, longevity and price while staying true to the character and history of its older fragrances.",
    "author": "BlueMusk",
    "date": "2024-12-17"
  },
  {
    "text": "Chanel no 19, how I've loved you for decades on end! I agree with so much of what has been written in previous posts. I wanted to add a comment without using official perfumery terminology, which is that Chanel no 19, for me, always started out to smell a bit like the liquor Gin, which has a base of Juniper berries. So, the green scent was never grassy or fern-like, but like crushed, green, Chinese Juniper berries. Extremely cooling & refreshing on a hot summer's day! Yet, Juniper berries are not on the list of ingredients. What can I tell ya? That's the forward scent which does retreat somewhat after wearing it 30 minutes or more, but still detectable & blending beautifully with all the other fragrance notes that have been well described in other posts. As others have said, Chanel 19 is indeed gorgeous and almost indefinable. So clean, light and feminine and no one will smell as wonderful as you except perhaps another woman wearing Chanel 19! I read somewhere, long ago, that it was Coco's favourite fragrance. Has anyone else heard this same thing?",
    "author": "GreenMansions",
    "date": "2024-12-12"
  },
  {
    "text": "Chanel 19 non ha più niente in comune con quello che era negli anni 70,80,90. Non si può dire che sia stato riformulato ma proprio cambiato. Nel confronto non c'è niente che li accomuni,sono proprio due profumi diversi. Buono anche quello attuale ma non ha niente a che vedere con lo Chanel 19 originale. Se un profumo era fondato sul muschio di quercia, narciso,mughetto, radice di iris,sandalo,vetiver e galbanum,la maggior parte di questi olii naturali è stata vietata. Mughetto vietato,muschio di quercia proibito,narciso con quello che costerebbe distillare quel fiore o anche solo il suo rizoma,non ce lo mettono, cuoio lo sento molto sintetico e strano,cioè non c'è piu niente che gli assomigli. Il vero Chanel 19 era freddo,severo,maschile,ricordava una giornata malinconica di cielo piovoso e freddo,ma nel suo essere così severo era anche confortante. Cel'ho ancora quindi posso fare il confronto e naturalmente preferisco il vintage. Più è vecchio e più è buono. Quello di adesso è molto lontano,un fragranza saponosa con un tocco di limone giallo inizialmente,molto più frivolo e allegro,sembra giallo trasparente,polveroso. Lo trovo anche piuttosto strano come odore. La prima nota risulta troppo strana e non conforme a quella che era nel suo originale. Qui le note si sentono troppo distintamente e non era certo nell'ottica di Chanel che invece voleva creare fragranze dove non si sentivano gli ingredienti, come Chanel n5. Anche se dopo un po tende a diventare più \"umano\" e si copre di fiori gialli, per il resto è un profumo gradevole ma ben lontano da come era alle sue origini.",
    "author": "massimilianoinquieto",
    "date": "2024-12-02"
  },
  {
    "text": "This is really pretty, and easier to wear than I expected. I routinely find that I tend to *not* be challenged by green scents unless they're quite heavy on oakmoss, so bear that in mind. This is a pale green fragrance though, and fits the color of the liquid well. Yes...there is a fair amount of oakmoss here, but it's really tempered by the powdery soapiness of the iris. Any more oakmoss and I would probably dislike this, but it's not as dusty as many other classics tend to be. Honestly, it's similar to how Chanel includes patchouli; instead of a rough patchouli, it's often a cleaner, crisp patchouli. Well...the oakmoss is like that as well, it's not as rough or fusty, but rather kind of bitter and crisp. Hope that makes sense. Everything can be, of course (wear what you love), but I do feel like although it's about 66% classically feminine, this is also easily unisex. The lily-of-the-valley alongside the green heart notes is very reminiscent of rain, but the dry quality of iris+oakmoss balances this out. And honestly, I think although this fragrance seems incredibly semi-formal or \"office-core\" (as the kids say), I'd just as soon wear this on a drizzly springtime hike on the woods. Very nice. And I'm bummed that my sample was nearly empty upon arrival, so I can only test it once, since I really would love to apply this in mid-April...it feels like the heart of spring 🌧 🌿 🌱",
    "author": "ShadowsofLight",
    "date": "2024-11-23"
  },
  {
    "text": "Okay, I have to add an update to my previous review! Found a half full bottle of the eau de parfum (old juice) which I purchased and wow! All I can say is that Chanel 19 eau de parfum (old juice) is just as beautiful, classy and uptown as I remembered it from my younger years. Crazy the memories just a whiff brings back... I do agree with others.. the eau de toilette Chanel 19 smells quite different.. not as soft, and creamy.. definitely a missing note. Chanel 19 has always been a head turner and almost indefinable... this scent will absolutely set the wearer apart from anybody else. Love Chanel 19.",
    "author": "Amby333",
    "date": "2024-11-12"
  },
  {
    "text": "Green notes? None here, thank GOD! \"Green notes\" make me think of grassy scents... THANKFULLY, there are NO grassy scents here as it settles. Maybe they're there at first? But they quickly fade upon spraying. Chanel No. 19 is truly a \"vintage-lipstick and rose-cream\" scent. The rose is truly a CREAMY rose, and this is what absolutely shines through. If you own No. 19 Poudre, that will be your gateway to the original No. 19... For me, this is SO much better! Chanel No. 19 Poudre has a sparkly-champagne twist to it, mixed with a dry powder aura. Its original version, Chanel No. 19, is creamy-rose made even creamier by iris and lily-of-the-valley. This is what I had always wanted No. 5 to smell like, but that one is too old lady on me (though, the spray lotion version is a lot more palatable to most). No. 19 does NOT feel vintage, it feels very new and modern to me. If you get this, literally no one will smell like you, but everyone will ask you what you're wearing because you smell so clean and pretty. As I mentioned before, there is no green once it's settled on the skin... either I don't know what people are talking about when they say green, or everyone else is crazy, LOL. To my super-smeller nose, this is all lipstick and creamy rose. The creamy part comes from the iris mixed with lily-of-the-valley, and I'm sure the gorgeous soapy-lipstick notes are from the aldehydes that Chanel is so famous for. Throw No. 5 out the window... THIS is what Chanel should be known for! No. 19 can be worn as a day-to-day scent, as it doesn't have long arms, but it DOES have a beautiful skin scent that makes you smell like you're wearing the world's best smelling lotion that lasts all day. Classy, feminine without being overpowering. Talk about a wedding fragrance!! So gorgeous. This is a stand alone fragrance, a master in its class, and if you love to smell really pretty, you should have Chanel No. 19 in your repertoire.",
    "author": "DragonflySparrow",
    "date": "2024-11-11"
  },
  {
    "text": "Many reviews of this perfume allude to the forest or to the “boardroom bitch” but this perfume transports me to a tennis court in the 1980’s. There’s a beautiful woman wearing a chic, white tennis-set. She’s a Beverly Hills princess that sports pearls and smokes Vogues. This perfume is icy, powdery, earthy, cold and creamy green. It’s beautiful worn in sunny weather, which helps to bring out the powder and the creamier aspect of the damp, mossy, green notes. The epitome of casual luxury, you can wear this to your Pilates class or the grocery store and feel like a million bucks. This is my first green perfume and my first Chanel, and it is unlike anything I’ve worn before. It makes me feel clean, plush and expensive, like I’ve just taken a luxurious bubble bath with a glass of champagne. Gorgeous.",
    "author": "cherrycreampuff",
    "date": "2024-11-08"
  },
  {
    "text": "Lo usaría :) olor fresco y dulce a la medida. En el secado se atalca bastante",
    "author": "Paolavvh",
    "date": "2024-10-09"
  },
  {
    "text": "smells like a forest with florals fucking amazing",
    "author": "Fragrancenerd98",
    "date": "2024-10-01"
  },
  {
    "text": "Absolutely gorgeous. Very green smelling, yes very much like freshly cut grass to start but overtime it becomes less grass smelling and more of a fresh earthy nature smell. The floral notes in it are gorgeous and give it a very clean light smell. The dry down is powdery (like most Chanel fragrances are on my skin) and woody. There's a very slight bitterness to this but also a very slight sweetness in a floral way which balances it perfectly. It's probably my second favourite Chanel fragrance after No 5 EDP.",
    "author": "elusiveviktoria",
    "date": "2024-09-14"
  },
  {
    "text": "Clean green soapy smell but weak projection and not very complex. I wanted to love this since everyone said it was complex but I was let down :( I enjoy the smell a lot, but it is too simple to me. I think this would work well for someone who wants an uncomplicated soapy green fragrance. It's a nice scent, but I wanted it to be different and complex but unfortunately, it fell flat on my skin. I think if you have the right skin chemistry the varying notes will be more pronounced. It is a safe blind buy if you are looking for a pleasant green soapy smell, but I will say that projection is mild and it may fall flat depending on your skin chemistry. If someone gifted me this I would be very happy, but I wouldn't necessarily go buy it myself. Overall it is nice, but didn't work with my skin, unfortunately.",
    "author": "beesbuzzing",
    "date": "2024-09-14"
  },
  {
    "text": "Adding another review because I have more thoughts to add - I instantly fell in love with this fragrance, mostly for how complex it is. This is not a one trick fragrance at all, everything is there, greenery of course, but also subtle citruses, woody notes, earthy notes, florals, and the same ylang and sandalwood that is at the heart of Chanel’s No.5 This to me conjures the image of being a young child, carefully exploring through a complex of thorny bushes at the back of the garden on a humid summer’s day - I can almost hear insects buzzing.",
    "author": "sjfb",
    "date": "2024-09-13"
  },
  {
    "text": "I am a newbie to fragrances, but have to say i LOVE this fragrance! The last time i smelled this would have been in 1978, I’m 64 now (yes I’m old!). I didn’t like it back then, and instead i bought Cristalle which i also love. In its new formulation, Cristalle doesn’t stay on me at all though and it’s gone in an hour. I never imagined i would like green fragrances, but this is very elegant, beautiful and sophisticated! It’s not screechy and I don’t find it sharp or bitter at all. It has the Chanel DNA through and through. I find it super soft and feminine. It was impossible to find somewhere that I could sample it. I tried 4 stores near me, so drove around quite a bit over a couple of days. I wanted to compare it with poudre, but can’t get to smell that anywhere! I will certainly replace this when it’s gone! 😍",
    "author": "Jillyflower",
    "date": "2024-08-03"
  },
  {
    "text": "I purchased this gorgeous fragrance directly at that very Chanel boutique at Rue Cambon 31,when I was in Paris in spring) should I say how precious and special this bottle is for me?) It really straightens your back and clears up your mind. I'd also add one more adjective into its description,-arrogant, but in a good, noble way. I have the feeling as if I have been looking for this very fragrance for so long and at the same time I've been familiar with it for all my life! Je ne sais quoi!) just marvellous!",
    "author": "Happyjulie",
    "date": "2024-07-31"
  },
  {
    "text": "Tried this one and Poudré side by side, and while both are masterpieces, Poudré works better on my skin. The in store tester of Poudré was much more similar to the EdP than my bottle, which i liked. And I think that’s because my current bottle is old and the vanilla is therefore stronger. No 19 EdP is a nice freshie, and Poudré is a more feminine version. They are very similar and you don’t need both",
    "author": "Evie01",
    "date": "2024-07-12"
  },
  {
    "text": "Update: I tried this rare gem again and I am currently deciding on whether I should get this one or another bottle of Poudré to wear to work after I am done with my current Poudré bottle It is undeniable that it is a difficult fragrance to wear because of it’s bitterness. It smells like summer where I grew up (the west coast of Sweden) with the mix of wild roses, freshly cut grass and seabreeze. I pretty much get teleported back to the seaside street close to my family’s house, where the fresh, salty winds blow against the luxury homes with their perfectly mowed lawns. Poudré is a completely different scent. That one is a strong grassy scent that turns into fine makeup powder. Poudré is stronger and ”stuffier” because of the powdery notes, which makes it a bit more youthful, girly and maybe more palatable. I find almost the same powdery drydown in Orphéon and Lipstick Fever. I am tempted to get the EdP instead of Poudré because it is more unique and less ”stuffy”, but it is a challenging wear with the bitter notes that border on being dirty. In the end, I will try both of them side by side, and my skin chemistry will make the final decision. Since they only have 19 EdP and Poudré in large bottles, I feel like I have to really love it before making a commitment and purchasing.",
    "author": "Evie01",
    "date": "2024-07-04"
  },
  {
    "text": "This shines in the summer! It smells so green, powdery, luxurious, sexy. I actually like that the projection is not super big like other chanel perfumes. That adds to the classy feel this perfume embodies. I am definitely glad to have this one in my collection.",
    "author": "bagaceirababy",
    "date": "2024-07-02"
  },
  {
    "text": "For me it is one of the most classic, elegant and sublime perfumes in the world. It is without a doubt one of my favorite Chanel perfumes. If I don't have it in my collection it is only because I have 19 Poudré, although they are actually quite different and this one surpasses it in performance. It is a natural, green, somewhat earthy scent, with a soapy and powdery background. It is the perfume that a forest fairy would wear when coming to us in a clair of the forest bringing a ray of sun that, filtered through the treetops, would transmit joy to us. It feels very balanced, neither the green notes nor the oakmoss nor the iris, nor certainly any of the other notes that are even more subtle and integrated into the composition, stand out too much. As for a comparison with perfumes that are said to be similar, it feels more powdery, fresh and less earthy than Silences by Jacomo. N°19 Poudré de Chanel is somewhat sweeter and more powdery, with much more presence of the iris. Revlon's Jontué is much sweeter and floral, due to the effect of mimosa and ylang ylang. All four are for me quite different perfumes and they could have a place simultaneously in the collection of someone who really likes green perfumes. On my skin it has a moderate projection and lasts 9-10 hours. Scent 8.5/10 Duration 9.5/10 Sillage 7/10 Quality/price 7/10 Versatility 6.5/10 Packaging 7/10 Would I buy again? I did not buy it",
    "author": "Taurien",
    "date": "2024-06-22"
  },
  {
    "text": "Galbanum, Iris, Vetiver, 3 notes I love combined masterfully! Love love love love love! 10/10",
    "author": "Anastasia.A",
    "date": "2024-06-22"
  },
  {
    "text": "This is very green. While not my preference, it is harmoniously blended.",
    "author": "saho93",
    "date": "2024-05-29"
  },
  {
    "text": "Anyone get a smokiness with this scent? It must be a combination of the green notes and something.....",
    "author": "kristenboris1997",
    "date": "2024-05-28"
  },
  {
    "text": "This is good stuff. If you've ever smelled Amla Oil (green-colored oil, Indian store) it smells a bit like that. Very herbal, oily, woody, and there's a touch of powder. It smells clean and reminds me of blue/white striped linen and having dinner al fresco (with lots of good olive oil). I like it but some aspects (probably the florals) can be a bit dated, and is probably quite cloying in warmer weather. It's dry white wine, French countryside, matching silverware/plates sort of thing. It's formal, but a weekend. 7/10 for scent, 6/10 performance. It's not very spring/young/sparkly. It's mostly feminine, with a bit of a unisex edge especially at the opening.",
    "author": "parfumparfan",
    "date": "2024-05-25"
  },
  {
    "text": "It’s Part of Chanel’s history that is definitely overrated but the fragrance itself is very good The opening of the green power blast is incredible and very alluring to me And it stays green for a little while then it starts evolving to an iris centred fragrance with greenness then the earthiness moves slowly to overcome the whole composition in the dry down I enjoyed it very much but I would’ve loved for the green notes to have stayed for the rest of the fragrance’s life cycle I think if I layered this with private collection by Estée Lauder it will be one of the greatest classy combinations of all time (hypothetically speaking) Performance was good but I had better performance when I oversprayd Definitely something to try and check out",
    "author": "Fragaddict123",
    "date": "2024-05-04"
  },
  {
    "text": "I had not tried this for years. I love Chanel. I love Iris. I love green...so why, after all of these years was this not in my ever expanding collection? I had to revisit and find out why. I ordered a few samples and now I know. To me this comes off like a very well made, classic light men's cologne. Not a unisex scent but olden days men's cologne that is on the lighter, fresher side. I am enjoying it but it's not quite me. Now on to try the pourdre version, that might me more up my alley,",
    "author": "Nancymae",
    "date": "2024-04-20"
  },
  {
    "text": "Sprayed it on my hand at the store.. it nauseated me, gave me a headache, abused me for the rest of the day because I couldn’t scrub it off",
    "author": "ayarossx",
    "date": "2024-04-19"
  },
  {
    "text": "this is the perfect “i just walked in a flower shop” perfume. it’s a strong, grassy, crisp scent. pure green perfection. unapologetic, sexy and attention-grabbing.",
    "author": "giuliatrapletti",
    "date": "2024-04-15"
  },
  {
    "text": "I recently acquired a 100 mL bottle of No 19 to replace my No 5 EDP. I find the opening explosively green and slightly bitter: Similar to Bel Respiro, but without the delicate floral accord. As it dries down, I imagine it turning \"purple\" - the iris is really pronounced and I do not get any rose or secondary florals. It seems pretty linear - however I have had a few remarks of it smelling like jasmine - maybe some hedione in the mix? I love experimenting with my perfumes and recently layered Chanel Paris-Paris over No 19 - It works effortlessly together, simultaneously lifting the floral profile of No 19 and reducing the cloyingly sweet character of Paris-Paris. What a triumph!",
    "author": "Jay1984",
    "date": "2024-04-07"
  },
  {
    "text": "This is the same scent as when you cut stems of flowers. Smells so extremely bitter. I really dislike it, I think I would actually choke if I did more than one spray. I can not elaborate more on longevity because this actually repels me...",
    "author": "Letmeregister",
    "date": "2024-04-04"
  },
  {
    "text": "The only Chanel women’s perfume I like due to there not being an emphasis on patchouli. Woody green delight. Chance, Coco Madame, and No 5 were all not for me.",
    "author": "Willowthewisp",
    "date": "2024-03-30"
  },
  {
    "text": "In its early stages it smells like a thick, humid forest I’d say - very complex - later on becomes more “sparkling” and classically pretty in traditional Chanel manner, not unlike Cristalle. Dry-down is iris-dominant, with the green notes still present, and the chanelade “no. 5” smooth ylang + sandalwood base peaks through. Beautiful and criminally underrated fragrance from Chanel. This for me is the best of their three trademark “green” fragrances (Cristalle, No. 19 & Bel Respiro) Solid 9/10 for me (Review edited three times)",
    "author": "sjfb",
    "date": "2024-03-23"
  },
  {
    "text": "I'm a guy. My entire collection is women's fragrances. This was a blind buy for me. And love at first sniff. The grassy green just won me over. It's spicy, floral, green like gardens. However, it has no projection. It has no longevity. The dry-down can become a little sour. Like the taste of coffee-breath. I love love love this fragrance. I wish it came in an Intense or Essence. The extra it or Parfum version might be more pronounced, but just as weak projecting and short-lived on the skin. You definitely have to over spray, respray, and carry a decant.",
    "author": "po3tik1",
    "date": "2024-03-03"
  },
  {
    "text": "Lovely green perfume but not long lasting, M happy to respray Try Estee Lauder Private Collection as well if you want a green scent and then decide which one you want Good luck",
    "author": "Tagimaucia",
    "date": "2024-03-02"
  },
  {
    "text": "I will not say any more than: ELEGANT!",
    "author": "bruby15",
    "date": "2024-02-24"
  },
  {
    "text": "I had a bottle of Chanel 19 when I was 20 and purchased in a Woodward's store way back in the '80s. I remember the bottle was tall and silver and looked so elegant. I felt so grown up and lady-like... even wore a bit to my first 'serious' job and a coworker told me she liked my perfume. I honestly can't remember how this smells.... I may have to purchase a bottle in the future to add to my collection. Chanel 19 is a classic timeless scent and perfect for any occasion.",
    "author": "Amby333",
    "date": "2024-02-23"
  },
  {
    "text": "In my 40s im gonna use 19 as a signature cus its mature in a lovely way and green and nostalgic i can get the iris and i love iris my friend says it smells like a powdery luxury(?) Grass thats kinda true",
    "author": "Mooluna",
    "date": "2024-02-01"
  },
  {
    "text": "I spent a truly glorious hour or so at our city's Chanel boutique, finally getting my nose on to so many scents that I've been yearning to smell for ages. So. the 19 EDP is a scent that I never got around to smelling before because I've always been a 19 EDT girl. Yes, girl - because I started wearing this scent as an older teen way back in the mid-80's and have been wearing it ever since. Unfortunately, I no longer own the vintage, and the current EDT is really something I only wear anymore out of nostalgia. It is only a shadow of its former self. Thus, I decided on this occasion to get a proper sniff of the EDP and to actually wear it to see for myself if, as some posters have written, it is better than the EDT in its current formulation. Well folks, it really is. No comparison in fact. The iris is so much more discernible in the EDP rather than just the suggestion that it is in the current EDT. In fact, every note seems truer in this version. The only thing I miss here is the hyacinth that distinguishes the EDT. Too bad I never was able to smell the EDP in its original iteration but this version is lovely in its own right. I'm about half way done with my current bottle of the EDT. When that is done I will happily go over to the EDP.",
    "author": "cookygirl",
    "date": "2024-01-26"
  },
  {
    "text": "I love this, it's my first Chanel fragrance. I have over 250 and not one Chanel until now. I got this for my love of bitter green Galbanum. One of my favourite scents for summer is Margiela Untitled EDP, this is very similar but slightly more floral. This is definitely unisex!",
    "author": "APMM",
    "date": "2024-01-26"
  },
  {
    "text": "Drips class and sophistication. Simply a masterpeice! This was on my wishlist l remember my mother and aunts wearing it and no 5 in the 80s and they smelled so good. I used to sneak a few squirts out of my mother's bottle it was the vintage one silver plastic square casing with the gold band round it and gold chanel disk on the top. With the removable bottle of liquid inside. I recently bought this a few days back but it was a half bottle as l saw the mossy green notes and thought maybe l won't like it now. I was wrong! This pretty green liquid has a big personality she's classy and sexy. She is better than no.5 and has more complex fragrance notes and projects further than no 5. She is liquid good breeding and class in a bottle, she rides horses and wears tweed blazers, has two carat flawless solitaire diamonds in her ears, shes a rich woman in her 50s living in a country estate mansion, shoots pheasant and mixes with royalty she's aristocratic. This perfume has those notes expected in practically everything neroli bergamot and the corresponding flowers like iris that provide the emmerging powdery phase and then just as your melting into the powdery loveliness a mossy strange note comes through that makes you wonder oh that's strange, what's that? An almost smokey type smell. Its like it shouldnt be a typically female perfume note, something masculine thats fallen into the perfume formula and no one noticed? Its strange, earthy but pleasant then you realise it's oakmoss and leather and vetiver and sandlewood giving it that masculine serious grown up edge, its like a well groomed man, a totally shaggable silver haired fox with suntanned skin and sparkling blue eyes and perfect white teeth, 😆 🤣 😂 a handsome intriguing gentleman in an expensive leather coat and italian gucci loafers (without socks) and trendy jeans and a grey cashmere sweater reading in a secondhand bookstore where you can smell his coat, his male scent, the soap he washes with and the books that have aged in this perfume and a tiny bit of cigar smoke, and oh my goodness it grows in scent and when you move about you smell these soapy, leathery, smokey, mossy, powdery, notes that smell so unusual but expensive. It smells so classy l adore it. I have immediately bought a full 100ml bottle of the EDP so I can fully abuse my half bottle and wear it constantly for a couple of months and not have to worry about it running out. It is the most gorgeous perfume. I've never smelled something so masculine but also feminine in such an exquisite way before. I'm obsessed already! I give this a 10/10",
    "author": "Suzanne loves Perfume",
    "date": "2024-01-25"
  },
  {
    "text": "Christ is this beautiful, the most luxurious thing I've ever owned. It makes one want to live up to it.",
    "author": "allJeeps",
    "date": "2024-01-18"
  },
  {
    "text": "Smells like the green offspring of of Chanel No.5 and Coco Chanel. Very powdery iris, earthy, ylang ylang, with a ton of moss and bit of leather. Not your typical fruity floral flirtatious spring-time perfume. It's more serious and mature scent. Very classic Chanel smell though. Will need to warm up to it. When I first sprayed it, I thought it smelled like gin. But the dry down is very powdery and mossy and POTENT. If you like iris, this is for you. Not sure if it's for me. Also, on a side note: I can sort of taste this perfume when I wear it though, which is weird. Maybe I sprayed too much? Update: I tried it some more and I'm disliking it more and more. I can't get past the overwhelmingly powdery iris and moss. And every single time I put it on I can literally taste it in my mouth and want to wash my mouth out. Not an inviting scent whatsoever. I would put this on if I had to be in a meeting with someone I despise. Very difficult perfume to like. Sadly had to return it.",
    "author": "skm50",
    "date": "2024-01-16"
  },
  {
    "text": "I think this fragrance is underestimated. It's classical with a small twist in the opening that gives me ambivalent emotions. Once I find it wonderful, other time overwhelming. Still, it's nicely powdery, close to the skin. And timeless, it's a true classic, even though not so recognisable as no 5.",
    "author": "Marta_Regina",
    "date": "2024-01-06"
  },
  {
    "text": "No. 19 was probably my first adventure into the world of fragrance, and it's become my most reached-for bottle since. I'm sure everything I own smells like it at this point. To me, this is the mother of all greens. The vetiver and sandalwood evoke an image of a forest by the sea, with cicadas buzzing and sand mixing with the leaves. The iris and leather are reminiscent of a rainy day in the city, while holding the sophisticated air that Chanel does best. It's Paris meets Provence meets Practical Magic.",
    "author": "caselizas",
    "date": "2024-01-01"
  },
  {
    "text": "I’m not a bitch but I wear N°19 when I wanna smell like one. A cool, grown up bitch. My dearest, darling mother's signature scent through her late teens into her mid to late twenties.",
    "author": "Smokeandhoney",
    "date": "2023-12-30"
  },
  {
    "text": "Bought this as a gift for myself for my 19th birthday. It is absolutely beautiful, smells to me like a very mature, opulent and classy female. Definitely similar to Penhaligon's Lady Blanche, but N19 is far greener and rugged. Lady Blanche smells like shampoo to me :(",
    "author": "weekee",
    "date": "2023-12-03"
  },
  {
    "text": "Floral, green, classic, nostalgic….. Remember smelling this as a kid, my aunts would wear this, I find it very nostalgic, classic, beautiful and french. Sampled this at the Chanel boutique, took few spritz on my wrists ran out for some errands and got compliments wish I had purchased it but most likely will add this to my collection. I would describe this a very luxurious, cooling, creamy, exclusive soap wrapped in green silk on a flowery, grassy breezy sunny spring day, this would lean more towards a mature audience, I can also see a younger, original, confident, unisex audience rock this especially if they appreciate these type of scents that lean towards nostalgics/vintage but also has a sense of modern aesthetic to it which is timeless and classic, I for sure do! Wish I had a bottle of the vintage edp to compare to todays formula",
    "author": "Romantic1",
    "date": "2023-11-20"
  },
  {
    "text": "I like No 19 but can't seem to find an edition that wows me. The current EDP is overpriced IMO and both current EDP and EDT do not perform as I would like. Still, I own the current No 19 EDT and enjoy it. It's good on clothes and skin but it's a luxury fragrance that one suspects Chanel has diluted. I had to wait a year for my \"new\" EDT to perform. My vintage EDP (20+ years) smells FANTASTIC but is a soft performer. My vintage EDT has off top notes, just as does my vintage Cristalle EDT. Perhaps the solution is a vintage that has never been opened and has been stored in it's box for two decades. Hélas, I'm not made of money. I recommend a couple dabs of pre IFRA edp then some sprays of the latest EDT on clothes and skin. I often see bottles of the new No 19 EDT on discount sites and also auction sites for half the retail price. I remind myself that No 19 wasn't designed decades ago with top notes to show off and seduce the buyer. (Or perhaps Chanel has neutered the top in recent editions.) Patience pays off. The vintage EDP enters a beautiful stage at about 2 hours. And I can smell No 19 EDT lingering, hours after, sometimes days after, in the room where I had sprayed it.",
    "author": "Mystères du Château de Dé",
    "date": "2023-11-12"
  },
  {
    "text": "This is a very fresh and green perfume, but it has a dirty and dusty smell in the dry down that I am really not a big fan of. The opening of N°19 eau de parfum is as I said very green and smells like a temperate and cool forest with its green notes, but it has a slightly citrusy and bright quality from both the bergamot and neroli and a hint of white floracy from the neroli too. The citrusy quality from the opening in N°19 then dies down fairly quickly within the first hour and a half. I like the floral heart notes the most in this fragrance, but they aren't quite as amped up as I'd prefer. You can still smell the very green quality from the opening notes mixing in with the heart notes and I can smell some of the dirty quality from the oakmoss and vetiver in the base peeping through. The haylike nuances from the narcissus then emphasizes this even more unfortunately. The powdery iris and a very unripe smelling ylang ylang (in the heart notes) then wafts now and again into my nose, reminding me somewhat of Chanel N°5. I can smell hints of rose and lily of the valley too, but they aren't at all prominent to me. It sort of reminds me of Ormonde Jayne for women at this stage. Finally, I can smell a very heavy, dirty, bitter, aromatic and overpowering dose of oakmoss in the dry down and it almost threatens to engulf all of the other notes in this fragrance. I can smell a strong and dusty dose of vetiver too and the sandalwood that is super woody and is almost as overpowering as the oakmoss in the dry down. I can't really smell the leather like most other people can on here though and my overall impression of the entire fragrance is that it smells like a very green and earthy tea with a hint of floracy to it. I got an impressive wear of 10 hours from Chanel's N°19 and a moderate sillage that was bordering on a strong sillage. Unlike N°19 Poudre, the original N°19 eau de parfum can't really be worn at the office and is better suited for both day and night outings from spring to fall. It is not a wear and go type of fragrance, unlike N°19 Poudre. It is also even more fully a unisex fragrance too, since it isn't as floral as Chanel N°19 Poudre and also has a less intense dose of iris in it. Chanel's N°19 eau de parfum is a very cool and unnaproachable smelling fragrance and is definitely not summery or warm smelling. Based on everything that I wrote above and my wear of this fragrance, I'd give it a 5/10.",
    "author": "WhiteFlowerPrincess",
    "date": "2023-10-07"
  },
  {
    "text": "Let’s be real - No. 19 has a reputation for bitchiness. As a part time bitch myself, I saw this as more of a pro than a con, but after smelling her for myself I have to disagree with that perception. The word “cold” gets thrown around in reference to No. 19 EDP but I think a better word is “cool.” Chanel No 19 EDP is a pair of cool, clean hands —palms still tinged with the scent of leather from an expensive handbag—on warm skin. No.19 EDP is not dark green like sap or grass; it lacks chlorophyll. Have you ever been to the Lincoln Park Zoo? In its conservatory there is a room called the Fern Room, which evokes a prehistoric landscape once known to the dinosaurs. It is damp and quiet and lush with waxy green leaves and moss. It is an ancient kind of green, a bit dusty maybe. That paired with the leather and lily of the valley smells almost clinical, which may explain why so many people equate No 19 EDP with doctors or even funerals. As the opening fades and the iris gets comfortable, No. 19 EDP transforms into something lush and floral. It rewards its wearer by becoming more and more beautiful with every hour.",
    "author": "cleoclesi",
    "date": "2023-10-03"
  },
  {
    "text": "I used to have this when I was in high school. can't recall why I got it and don't even remember the scent. Start collecting chanel perfume recently, bought a few from the exclusive and now considering collect the classic ones. tried no5, but I think I am not mature enough to appreciate it. so crystelle and no19 came to my mind and need to select one. the crystelle edt was too sharp on me, so I tried to edp one. smell gorgeous on paper but not so well on my skin. then, tried no19, both the edp and the lighter version and finally bought the classic edp. in fact, the lighter one is very nice, less sharp, more powdery, floral is more standout, yet, longevity is so bad on me. almost gone in 15 min. 19 edp is less powdery and more earthy, which is not something I prefer, but it has the crystelle vibe in a more elegant way, while better silage than the lighter version of 19.",
    "author": "Fat rabbit",
    "date": "2023-09-13"
  },
  {
    "text": "Contundente, rotundo, clásico y retador al mismo tiempo; equiparable a la perfumería de autor. Resulta lo más andrógino que he probado hasta el momento. Obra maestra efervescente hasta que se desvanecen los aldehídos que si no se declaran, los percibo igualmente.",
    "author": "Acv",
    "date": "2023-09-09"
  },
  {
    "text": "Review for current EdP formulation, tested on a warm, humid evening: The drydown has a creamy, powdery aspect reminiscent of no.5 (it’s the ylang and iris), but here it’s cleaner and green, smoother. There is abit of floral sweetness from narcissus and rose, and the leather note is smooth and subtle. Overall, a well-blended and balanced fragrance. Extremely elegant, but warm and modest at the same time. A ‘proper lady’ perfume that isn’t overtly perfume-y. Reeks of status and refinement, but in an understated manner. I love it! Very comfortable to wear, but I personally would prefer this for spring, summer and early fall, the sweet floral notes come through better when the weather is warmer, I imagine it would lean more bitter-green if worn in cold weather. Perfect for office/professional use, or as a distinctive signature, or whenever you want to put your best foot forward in any formal setting. I imagine a soft-spoken doctor, or a demure professor wearing this scent as a signature… she’s neat, attractive, intellectual and quietly alluring, someone loved and respected by her peers. Not a trend follower, but an individualist. This is a very feminine perfume imho, but a rare sort of femininity these days, and the kind of feminine energy I perceive from this scent is graceful, calm, mature, and down to earth. Not sexy, not ‘cutesy’, not ‘boss-babe’, not self-centered. Very good longevity for a daytime scent, sillage is low to moderate depending how much you spray. Nothing bitter or sharp about this scent (atleast not on my skin and in the current weather condition I’m in), it’s buttery smooth and softly powdery, a fuzzy pale green…you just need patience to let the grass-like top notes fade, give it 20-30 minutes to settle and you will be pleasantly surprised. I was with a friend when I tested this (another perfume lover), he thought it smelled very pleasant and luxurious but ‘too mature’ for me. He said he could see this being my scent 10-15 years from now. I didn’t care, I wanted to own it now. I fell in love as soon as the fragrance warmed on my skin, and it naturally felt like it was a part of me. The other more mainstream fragrances I had tried on that day smelled meaningless and flat in comparison.",
    "author": "marialena888m",
    "date": "2023-09-03"
  },
  {
    "text": "Rich deep green. I have a vintage bottle and the depth is amazing",
    "author": "Zethre",
    "date": "2023-08-31"
  },
  {
    "text": "Male review I have written a comment regarding No5, this is also a classic French female floral-chypre fragrance, subjectively to my nose. (I am not an expert in all these classifications) As a perfume connoisseur, I can recommend it for every woman who really appreciate classic French perfumery. This has nothing to do with modern commercial perfumery. This is very complex, eloquent and timeless. For lots of people, this will be also old fashioned. Well, you can call it in both ways, because it depends from what you like. Both are quite right. This is old fashioned, because this was a completely different perfumery's epoch, yet timeless, because the smell is very classical and undoubtedly French. You must not like this type of perfumery, but If you find yourself a perfume enthusiast, I strongly recommend to train the nose and try to appreciate this. This is built differently, like Chanel No5, Shalimar, YSL Rive Gauche and many others. Light and airy, white Musks (Nitro-Musks, maybe polycyclic Musks), very high concentrations of Hedione, Linalool, Ethyl-Linalool, Evernyl (oakmoss), also alfa- and beta-Ionons, Rose constituents, Vanillin, Citruses and well selected naturals. I believe, that Aldehydes can be in the construction as well like in No5. Also Cedrol or Isobutyl Quinoline (leather), Lixetone, Vetiver raw materials - I imagine it been built around some of these raw materials. This is undoubtedly bright on the start and owns powdery, woody and aromatic qualities in the dry-down. Eloquent, it can make some vintage associations to some people as well. Smells very natural, bright opening more in the sense of citruses and it definitely takes more woody direction in the dry-down, than No5 EDP. I also reminded myself about cis-3-Hexenol, as a quite strong green top-note raw material, which can potentially be here in the opening. (It smells very nice, like a freshly cut grass, I bet it works really well with citruses.) This is an elegant, day-night perfume, really suits the professional environment or special occasions. You can wear it to the theatre together with a beautiful evening outfit. It deserves to be worn more elegantly for sure. This was just my opinion, so you can always take it with the grain of salt. I really appreciate this as a man. Very beautiful. Sadly, very view people understand this type of smells nowadays. Very well said, @pygmalia.",
    "author": "Dvntex_",
    "date": "2023-08-29"
  },
  {
    "text": "I have always loved this fragrance but allas it doesn't work on my skin. First let me start by saying i have a full 100 ml bottle I'd like to either sell or trade for something cool if anyone is interested. :) Feel free to PM. Now for the scent. I have loved this since i was young. I didn't know anyone who wore it but i did sniff it out in a department store back then and fell in love. It's very hippie chique. Very 70's. There is a lot of vetiver action going on and even though it is super classy and maybe a little shrill as people often say about this. There is a nonchalance to it. It's not all contracts and paperwork. I don't normally love green fragrances and this is extremely green. But, it has a smoky undertone that matches the overall vibe like a raspy smoker's voice coming from a fancy refined well dressed young woman. It's because of this that i realy do love it. I wish i could pull it of but it's too bitter on my skin. :( Part of me wants to keep it till i grow into it since it is either discontinued or too high in price nowadays but i feel like that is such a waist of this beauty.",
    "author": "miewtje",
    "date": "2023-07-21"
  },
  {
    "text": "OK so try not to get too emotional about this.. but Chanel N 19 do not buy this. All this is is Coco really toned down with grass. Just not what I was hoping it would be. Touted as some sophisticated scent . So classy? so lovely,, so beautiful ??? Holy crap. why has no one said something about this?? how It got a 4.19 is beyond me.. The stuff is disgusting.. as a hard-core Chanel perfume lover.. don’t do it .. completely vintagegy completely Coco with grass.. unless of course you’re a fan of Coco but you might as well buy Coco EDP, because it’s much stronger than this.. I usually try to refrain from calling something vintage old lady vibes, but that’s exactly what it is. This is not the formulation from years ago, obviously and from what I am told it was a much better scent.",
    "author": "MCW7",
    "date": "2023-07-19"
  },
  {
    "text": "I have the vintage No 19 EDT, why isn’t that on here? It’s very nice",
    "author": "RottigrlNYC",
    "date": "2023-05-29"
  },
  {
    "text": "19 EDP, store test. 19 EDP is very beautiful emphasis of Green grass accord. The scent is cold, green and will take your heart by storm if you like a green scent. The scent is everything I could ask for. The green grass and tangy smell of galbanum. The mild floral on powdery iris. Along with smooth bed of little sweeten vanilla and dominant vetiver. I could love this, I should love this. But No, this is tiny bit brighter than La Pausa. It’s cold but still bright. La Pansa steals my heart as epitome of Cold Green Iris. Emphasize on Orris root in Rooty manner lay beautifully on Chanel’s green accord. I am sorry but I just can’t bring you home.My heart was stolen by your older sister La Pausa. If you are not the fan of iris but seeking the green. This offers the green grass color in the best manner. Please stop-by Chanel and visit this gentle masterpiece.",
    "author": "tanaC",
    "date": "2023-05-19"
  },
  {
    "text": "I am a vintage No19 hoarder. I had not smelled the current formula Edp until I got a bottle a year or so ago (left to age). Comparing current beautiful bottle to grey cartridge Edp from the late 90's. In the opening, the vintage is sweeter, rounder and oilier(in a good way). The current is drier and I sense pale vetiver very early on--it is more spare and open--thus I feel it would be a superb masculine. I am pleased that in the mid-to dry down they are close--still high quality. The vintage is just more lush in small ways. A more round iris rose mix and longer mid phase. In the dry down vintage becomes part of my own skin--the current is more a bit of dry green grass. J.Polge created this to be sweeter and stronger than the cologne which they phased out...cologne and vintage EDT were quite similar towards the 80's. I have big bottles of both, Edt seemed a bit more chypre maybe. The vintage extrait is the pure power chypre of legend. It makes me an Empress of the Forest--much warmer and damp oakmossy. It can be challenging--but if you are right for it...sublime If you want to go on the vintage hunt-- you will get more facets from ingredients no longer allowed or available--BUT we should thank Chanel for still making this.",
    "author": "LQR28",
    "date": "2023-05-17"
  },
  {
    "text": "Smells like an old person's medicine cabinet😬 I just think Chanel has really stuck in the past and it's like so aging for a perfume. I would even lean it more masculine because there's these mossy moldy wood aldehydic notes that I wouldn't relate to feminine fragrances. This may have a great sillage, and longevity but I can see people keeping their distance away from you. Not worth a Zodiac trio🤢",
    "author": "MysticalArugula",
    "date": "2023-04-17"
  },
  {
    "text": "Smells like a fresh summer day. It’s the most natural smelling perfume I’ve discovered. Perfect to wear to work, but I prefer the Poudré version on my skin. Just like Poudré, it gradually meshes with the skin chemistry and becomes better in the dry down",
    "author": "Evie01",
    "date": "2023-04-07"
  },
  {
    "text": "I had to drop in and leave another really quick review about skin chemistry along with weather/seasons and wearing this particular gem. Some people enjoy wearing this in the winter for various reasons I have read. Every time I have tried, it stays way way too bitter and cold. It feels very melancholic and depressing, to me. Perhaps a winter funeral could be an ok wearing. I have oily skin and it just never blooms on me during the cold months. I have found that this blooms in warmer weather. The past couple of days in Indiana have been in the 50s/60s and today it is very rainy. This scent, along with the EDT and Parfum (still haven’t tried the cologne) just absolutely work this time of year. As well as in summer. But right now it’s just a perfect spring wear (for me). I hope this helps some folks who may have tried it in the cold and found it not to their liking. 🥀",
    "author": "rosetinteddream",
    "date": "2023-03-31"
  },
  {
    "text": "After having let this sit for 6 months I finally gave it a real try. The opening is very green but rounded and I get a little leather that is also smooth. I smell some flowers also. About an hour/hour and a half It's more floral with lily of the valley being the one I can pick out. The leather is way in the background and smooth. It is still green but in a softer way and I think it is beautiful. In an hour or two it doesn't change very much except the leather is gone and it is slightly powdery in a very good way. A Gorgeous springtime fragrance that is very sophisticated. It's definitely one of the best in my collection, but that seems to be how I feel about all my Chanels.",
    "author": "jeanette123",
    "date": "2023-03-30"
  },
  {
    "text": "I have a bottle of 2006 Parts in my hand. opening to realize notes of iris, neroli and green. After about 20 minutes rose and oak moss arrived. I likened it to the sisley eu de soir penny. a perfectly pure rose and oak . ummm i faint..",
    "author": "Serayyaren",
    "date": "2023-03-29"
  },
  {
    "text": "Owning this bottle is a pleasure! The green liquid inside is so elegant, which works because this is very fascinating on the skin. The green notes and leather really appear front & center, making for a very unique smell that is addictive! I don’t think this is necessarily a good choice for a blind buy, but worth it if you decide to try it. :)",
    "author": "Perfumerzlove",
    "date": "2023-03-29"
  },
  {
    "text": "I'm not really a Chanel gal but No. 19 is a thing of beauty. I wear it when I need a little boost in self-confidence in getting things done. There is no sweetness in this fragrance. Green, iris-y and leathery, this perfume smells like understated power, class and old money. Probably wouldn't describe it as a sexy perfume, but that's not a problem - sometimes we don't wear things for romantic attraction! It works wonderfully in hot weather, less brilliantly so in colder weather.",
    "author": "villiruusut",
    "date": "2023-03-28"
  },
  {
    "text": "Nice green/grey type fragrance that smells extremely classy. It definitely leans feminine and I can see why they chose to market it in that direction but it could be worn on a man I think. It has some soapy tendencies but I don't interpret it as soap (I love soapy fragrances) but it does feel clean with some polish. The neroli iris combo here is so well done. Unfortunately on my skin it didn't seem to last the first couple times I tested it, but that was also in cooler weather. I'm going to try it in the heat and see if it affects the feeling and blooms on my skin. I really like it but not enough to motivate me to spring for a bottle at this time. However it is really good and definitely worth trying if you can sample for free Scent 7/10 Performance 5/10",
    "author": "The Wolf",
    "date": "2023-03-25"
  },
  {
    "text": "I am staggered, EdP very similar to Habit Rouge on my skin! But EdT isn‘t. Anyone else noticing that? I knew No.19 (the soap is my childhood memory) and tried current versions several times before I bought it. I find most Chanel scents somewhat “not warm”. No.19 EDP in particular is cool in a good way, and on my skin leather gets really noticeably strong…",
    "author": "auldmisserard",
    "date": "2023-03-01"
  },
  {
    "text": "This scent is very cold green notes. The aesthetic is amazing and the color looks delicious. However, I was hoping for a scent more complex and captivating and this wasn’t it. I would not recommend No. 19 to anyone looking to smell youthful, fun, flirtatious, etc. Also not a safe blind buy.",
    "author": "magnoliaboulevard",
    "date": "2023-02-17"
  },
  {
    "text": "Beautiful.I almost dismissed on initial spray. Give it 40 seconds after first spraying.....then decide.....wow. Absolutely hooked. I haven't the experience to describe perfumes in detail. But this one develops over time, getting better and better. I could still smell it at the 6 hour mark. Different to my usual floral type buys. Love #19.",
    "author": "Lou34",
    "date": "2023-02-09"
  },
  {
    "text": "Earth odour , but so exclusive",
    "author": "elisa.fuentes.1",
    "date": "2023-02-02"
  },
  {
    "text": "Could someone talk to its performance these days? They were out of it in store but recently I re-sampled No. 5 in EDP and was shocked by how little it lasted, and how “small” it seemed. Am very curious to hear if anyone feels something similar has happened to 19.",
    "author": "allJeeps",
    "date": "2023-01-16"
  },
  {
    "text": "This being compared to Synthetic Jungle is the biggest insult and eye roll of the century!!! Superiority resides within No 19. Timeless. Cold. Sophisticated. Isabelle Huppert in a bottle? I have nothing else to say.",
    "author": "Alex",
    "date": "2023-01-07"
  },
  {
    "text": "How does Chanel #19 EDP smell vs Chanel #19 EDT? I have Chanel #19 EDT, & YSL Rive Gauche, & Paco Rabanne Calandre are indeed very similar to Chanel #19 EDT, as suitable recommendations.",
    "author": "shenamedel",
    "date": "2022-12-19"
  },
  {
    "text": "By reading the glowing reviews, I am not sure weather I ever expirienced the beauty of No.19. I owned a purse bottle of this years ago, looking like a Chanel lipstick case but in grey instead of black. I tried this scent so many times only to be puzzled by the smell of heated plastic (like the heated car-interior in the pre-aircondition era). I took the refill bottle out of the case because I thought, that it was maybe the case, that smelled so nauseating, but... no. From what I know, it was Coco Chanels signature and from what I further know, this perfume sells very badly. I don't get green notes (green smells to me like fresh cut grass). It is very dry, almost suffocating. In fact, it smelles like perfume turned bad. Now the older Coco Chanel was quite a thistle and from the interviews I saw and read, a very stubborn, bossy, principle riding and all together a unpleasent company. If that was her perfume, it certainly fits the bill.",
    "author": "Mme Bovary",
    "date": "2022-12-08"
  },
  {
    "text": "Just beautiful. Superior smell and longevity to the 19 Poudre. This opens heavenly with the smoothest powdery iris. Later galbanum becomes more prominent, giving a slightly bitter and green edge to the scent.",
    "author": "GreatGreyOwl",
    "date": "2022-12-01"
  },
  {
    "text": "What a beauty! The opening is very... green. Almost harshly green, cold and raw. But once the dry down hits you, you will be enchanted. It's the most elegant, stylish, chic and effortless scent. It's warm and sweet with just a hint of fruitiness. This is pure luxury and sophistication. Mature yes, but like a fine wine, it's expected to be. In love with No 19 Edp.",
    "author": "AntonioM",
    "date": "2022-11-22"
  },
  {
    "text": "Deep notes are very good, and you can feel the same vibe of Tom Ford Arabian Wood✌️",
    "author": "pelega",
    "date": "2022-10-17"
  },
  {
    "text": "I am super lucky to hunted down a vintage splash bottle of N19 EDP where I found the opening is quite different from the current formulation! The old splash bottle is strong on the bitterness especially with galbanum!! The galbanum is super rich and intense in the splash bottle where I don't get much of it from the current formulation. Damn whish I could hunt down more of these vintage splash bottle lol",
    "author": "barry1052",
    "date": "2022-10-04"
  },
  {
    "text": "So, I deleted my previous review about the longevity of this scent. That doesn’t mean it doesn’t have longevity issues, because it truly does, but I found a remedy in my situation. I’m passing it on here in hopes that this may help to spark ideas for you. I was reading reviews and I came across one where the reviewer stated that in order to correct the longevity problem that they were having, they simply layered this over Molecule 01. That got me thinking. I don’t have Molecule 01 but I do have Perfect Veil in the roll on perfume oil. I thought, what do I have to lose by trying it out? I mean, nothing ventured, nothing gained, right? The worse that can happen is that I don’t like it. This morning, I decided to give it a go. First, I very lightly applied Perfect Veil, then I sprayed this over it. The result? Absolutely DIVINE! The scent is truly ethereal AND it lasted all day long. I got whiffs of it through out the day. Perfect Veil added just a touch of sweetness to it, but other than that, it didn’t alter the scent. So very glad I tried it. Edit to add: I read other reviews stating the opinion that this scent smells like it is for a cold hearted, calculating, wire mother, total bitch of a woman who is venomous, poisonous, hissing, and down right vicious who would chew you up and spit you out across a boardroom floor.. I don’t know about Gabrielle Chanel, but anyone who knows anything at all about me knows that description doesn’t fit me at all. The truth is, that is not at all what inspired the making of this scent. I’ve read that this scent was inspired by Chanel’s weekends spent in the French countryside. Namely, the country house that Chanel owned, Bel Respiro. It is no wonder that fragrance in the Les Exclusifs line smells somewhat similar to this. This is an earthy scent inspired by nature and the earth, not by the kind of woman some may think Chanel was. Because of those kind of reviews, it stopped many from even trying this beautiful scent. I don’t find anything evil or cold hearted about this scent. I do, however, wonder about these reviewers’ intentions when writing such reviews though. It’s one thing not liking a scent. We all have likes and dislikes, but to use tactics like expressing that only an undesirable type of person would wear such a scent is a personal attack on those who love and wear this scent. As for everyone else, don’t take just my word for it. Try it yourself and see what you think.",
    "author": "ChelleBelle84",
    "date": "2022-09-27"
  },
  {
    "text": "Best Chanel! One of the most beautiful perfume on the world!",
    "author": "black_orchid",
    "date": "2022-09-25"
  },
  {
    "text": "Although it is lighter than decades ago (thanks to EU and IFRA regulations, not due Chanel) you must remember NOT to start using it right after buying. It needs to sit and \"marinate\" in the shelve few months after transportation since it has a big impact to the composition. Also - Chanel tends to sell its fragrances while they are quite young/fresh, so ideally let it sit in the shelve few years and you feel the difference - it has turned much stronger and greener. It is not only about reformulation but also timing - this lovely gem WILL be strong and powerful in years and decades after its created and bought. No 19 EdP is classy non-sweet green mouthwatering juice. Suits perfectly (nordic European) autumn and winter and not so much warm seasons in my opinion. It needs the smell on wet soil and falling leaves to reach its full potential.",
    "author": "Mutrike",
    "date": "2022-09-22"
  },
  {
    "text": "This is the absolute smell of the color green to me, aside from Balmain Vent Vert- surprised that one is listed so far down the Reminds Me Of list. Dry, green, green, GREEN. It of course smells a bit dated, owing to its age and style of its contemporaries, but it is a classic for a reason. High quality and unique.",
    "author": "brand117",
    "date": "2022-09-15"
  },
  {
    "text": "I am writing this review without ever experiencing the vintage original. And my first experience with 19 was the poudre version, also modern formulation. At first, I couldn’t really detect a huge difference between this and Poudre. I actually had to spray them each on their own arm to smell the differences. And while I do think they definitely have similarities, there are distinct differences between them. I do think the opening is similar, too similar for my enthusiastic novice nose to detect any noteworthy differences. But as they start to dry down, I do notice that Poudre really jumps into that soft irisy powder. The Iris is the star of the show. While 19 still has Iris, it fervently holds on to that little bit of greenery from the opening, as well as allowing some other soft florals to come forward. Here, the Iris while still present and noticeable, is a little bit more like a supporting character. These two fragrances, in my mind are definitely sisters, impossibly beautiful sisters. You think you are in the presence of the prettier one, until you put the other one on. Both absolute winners in my eye for truly remarkable fragrance. Both leave me wanting more when the scent eventually fades. One thing I don’t really get… and maybe it’s because green fragrances really haven’t been considered “in style” in my lifetime… is the almost constant references to this being cold and bitchy. To me it is not. I get beauty, intelligence, confidence, and timeless sophistication. And that’s really with both 19 edp and Poudre as well.",
    "author": "Lyric82",
    "date": "2022-08-22"
  },
  {
    "text": "Simply put; grab your lawnmower, mow the lawn and grab a tuft full of cut grass and smell it. Chanel No.19. The bottle is gorgeous, the colour is stunning but I can't do the top notes of this smell. Settles down into something nicer, more floral but the initial top note is just cut grass. Probably not a safe blind buy.",
    "author": "kyradl",
    "date": "2022-08-18"
  },
  {
    "text": "I am obsessed with Coco and Coco Mademoiselle Intense, however I still keep trying to understand 19 from time to time, but… It smells just like grass🌱 I have tried it on my skin, on clothes, checked every hour til it was totally gone, but it just smells like bitter grass. P.S. I think it reminds me camomile tea Sadly, I have to admit that I give up on you, no.19, we were not meant to be together💔",
    "author": "Gioia's secret",
    "date": "2022-08-18"
  },
  {
    "text": "Recently treated myself to a full bottle of this, blind-bought, thinking Chanel is always Chanel, but what a disappointment! It has zero longevity and zero lasting power! I got an EdT version of this in the late 90s when I was around 15-16, and I remember it lasting forever, and granted it always was a discreet scent, but it still had a good sillage, especially for an EdT. But this current EdP version has sadly lost it all and is pretty much dead in the bottle, so incredibly sad. -It reminds me of that scene in Luc Besson’s “Nikita” (1990) when after her first assignment, when she’s been instructed of a window in a restroom to escape through, only to find it walled shut. Chanel No 19 no longer offers the escape that it used to, Which sadly seems the case with most classic perfumes these days… So I have even less hope for the current EdP. I guess the way to go is to track down a vintage bottle. Oh well, at least the bottle is decorative. I would strongly recommend you go for a vintage bottle instead, because what is currently on Chanel’s shelves is nothing but faintly scented water with zero silage and absolutely no lasting power.",
    "author": "Figliodicaterina",
    "date": "2022-08-08"
  },
  {
    "text": "Needless to say this is a legend, somehow I feel happy that Chanel is not pushing this fragrance Iike N5 now a days nhahaha don’t want N19 to be as famous as N5, so I can wear this for myself Haha",
    "author": "barry1052",
    "date": "2022-07-31"
  },
  {
    "text": "Beautiful bitter galbanum, paired with a powdery, sentimental Iris. The most Boss B fragrance you will ever try. So stoic, intentional and sincere with the grounding vetiver and Oakmoss. This is generational legacy, honour, family crest. It has a biting quality that warrants respect but the bitterness isn’t overwhelming. She is a subtle glance, not a loud commanding voice. A perfect balanced and refined fragrance. It isn’t much of a people pleaser but I adore it. Very unisex with moderate performance.",
    "author": "Advaitaforever",
    "date": "2022-07-20"
  },
  {
    "text": "A word of caution to those looking for vintage bottles… I have just tried my own mid-90s bottle of EDP and it’s not how it used to be. No top notes, no fresh greenness. Fleeting performance. I’d be very disappointed if I’d purchased it online, hoping for the mythical magic of vintage formulations. It’s all well and good for some fragrances that age well, but some certainly fare better than others. Same issue with a 10 year old Coromandel EDT I recently spent an eye-watering amount on. My no. 19 was still fairly full and carefully stored. It was a stopper bottle. Maybe a sealed spray would keep better? Maybe your own vintage bottle smells fresh and delightful? I’m very happy for you. So spray with abandon! Don’t always save those favourites for special occasions. They could well go off on you and become unusable and wasted. I have kept a treasured Cristalle too from the 80s, which I’m too nervous to test in case it’s the same story. … Now I’m grumpy.",
    "author": "betty_bounce",
    "date": "2022-07-16"
  },
  {
    "text": "Chanel no 19 EDP has become a top offering in my spring & summer fragrance rotation. The very green & sharp galbanum opening is so welcome in the heat but it changes thankfully into the most sublime rose, powdery Iris & narcissus brew, made sweeter by neroli. Effortless & chic is how I feel with this one. Lasts all day on me. I hope it’s never discontinued. I save the parfum version for special occasions. No 19 is a dream.",
    "author": "bluesunshine",
    "date": "2022-07-04"
  },
  {
    "text": "I see most people are put off by the initial galbanum scent, which is rather harsh in itself, especially if you come from a culture where fragrances and spices are not loud. And rewarded are the ones who are patient and wait for the perfume to settle down. To me, galbanum was not an issue, as I could immediately imagine the yellow flower from my childhood, and the smell it projected when we tore or smashed its leaves. True, I did not want it to stay there, in my perfume, for eternity - it is an overpowering scent that tends to cover everything else; but it did not last long, just enough to wake me up and intrigue me. And then came the most beautiful and unique blend of aromas. The rose is not too much, the iris is not overpowering - if you pay attention, you can feel each one, but like with a good orchestra, the mix is what is best. Nothing to compare it with, to this day. Its versatility and uniqueness still amaze me. I must admit I do not understand those who perceive it as dated. I discovered it at a rather early age and I found it refreshing from the beginning. At that time, my problem was I found it too good, too sophisticated to be worn among people my age, dressed in jeans or sports shoes or skirts a bit too short. But I did not have to wait long until I could wear it every day. And I was lucky it suits my skin perfectly (in time, I came, like all of us, across perfumes that did not sit well on my skin, although I loved them on paper or other people). It is rather discrete - as elegance actually is - it may not be the love of those who prefer loud, sweet or heavy perfumes. You do need a good nose to enjoy it. I hope Chanel will keep it forever and not alter it.",
    "author": "Dixneuf",
    "date": "2022-07-01"
  },
  {
    "text": "Really curious about this one if anyone has a decant! Also, wondering how powdery it is exactly? In comparison to something like no 5. Or even poudre which turns almost all powder on clothing. Would you say this dry down is more green or powdery?",
    "author": "Dashalu",
    "date": "2022-06-19"
  },
  {
    "text": "[300] Chanel No. 19 is one of my favourite Chanels. I have a particular love for green scents, and No. 19 is a classic of the genre. Firmly rooted in the 1970s, it reminds me of Gloria Steinem in her heyday - feminine and powerful, individual and elegant. The green liquid in the iconic square Chanel bottle gives me joy, and the perfume smells even better. I hated this when I first smelled it as a young teenager, but it is a complex, masterful, vintage-style composition - an acquired taste (or smell). During the pandemic, it was hard to find, so I bought two bottles of the current formulation when it came back in stock. I have a vintage miniature EDT, and it is not dissimilar - but the galbanum here is slightly thinner and more bitter while simultaneously being more dewy. The No. 19 of today is still an austere, pursed-lipped lady from the 1970s delivering cold, verdant elegance. No. 19 opens with a rich, dewy green accord featuring a tart galbanum note, and some waxy florals, thanks to the heady hyacinth note. Some green lily-of-the-valley creeps in, complementing it beautifully. Some iris emerges at the heart of this scent, the most prominent floral note after the hyacinth - a nice nod to Chanel as a fragrance house. It is wonderfully powdery and melancholy, but is soft and fleeting. A little clean jasmine is in there too, alongside a nice, polleny narcissus note, but the green-hyacinth-iris accord is the main event. The chypre drydown is thinner and somehow sterile in comparison to the rich drydown of my vintage EDT, but it is still earthy and mossy, with some vetiver and woody notes, providing a nice cohesive development from the green opening. My big issue with modern No. 19 is its performance - for an EDP and at a Chanel price point, it is very disappointing - fleeting and light. Its big, green opening fades very quickly, and it is barely detectable when I arrive at work, having sprayed myself before leaving the house. I keep a smaller bottle in my handbag for reapplication - it is just too good to not wear and enjoy. I must track down a big vintage bottle in the quest for better performance (and maybe also for a richer galbanum note and more well-rounded chypre drydown.) No. 19 is a distinctly 1970s green scent that delivers cold, clean, ladylike elegance that also smells great on a man. Inoffensive and fresh, yet masterfully composed, it is ideal for daytime office wear. A prim and proper lady by day, and a 70s diva by night, No. 19 is understated power in a bottle. One of my favourite Chanels, but points lost for dismal performance. However, the scent itself is too good to give up. Verdant beauty, by way of Chanel. 4/5.",
    "author": "Enrium",
    "date": "2022-05-29"
  },
  {
    "text": "I can’t imagine a situation, season or time of day where 19 is not suitable. Icy yet friendly, Green yet warm, like a blanket. An extraordinary composition. My true love.",
    "author": "Nosyla",
    "date": "2022-05-14"
  },
  {
    "text": "I quite liked this one, much like the other No 19s in the line, though not enough to splash out for a bottle... Green and iris dominate upfront, as well as a nice mix of white florals in the background. It does kinda lean femme in some ways, not that it bothers me at all, but it is something that stands out about this scent. I could happily wear this again, just occassionally, but I don't see myself ever wanting to own it. Nice, but not amazing...",
    "author": "muzzbait",
    "date": "2022-05-14"
  },
  {
    "text": "Most under rated and un-hyped of the Chanel arsenal... This is one you totally wear for yourself. It feels icy clean, cool and empowering. It still gets me every time. Chanel No. 19 is the most a breathtakingly green fresh scent ever.",
    "author": "Stampinator",
    "date": "2022-05-10"
  },
  {
    "text": "This reminds me of the smell of a garden. Not at midday when the sun is pelting down mind you, but the very early hours of a spring going into summers morning. When the dew is still sat on top of the grass and covering the leaves, and when mostly everything is still covered in shade. This fragrance is that for me - serenity. It’s transportive and calm, and very nostalgic. In comparison to some of the other Chanel’s it is quite light, but it is simply made to be worn in a different setting to the others.",
    "author": "fragrancechamp",
    "date": "2022-04-03"
  },
  {
    "text": "Surprisingly, this does not last as I would expect from a Chanel EDP, tried it out on my arm at the store, the lady spritzed my arm just once, so keep that in mind. Initially I get a sharp leather-bergamot sort of scent (so unexpected), I've now discovered I really dislike leather as a note. After 30 minutes, it dries down to a skin scent, the oakmoss blends beautifully with lots of iris, the vetiver gives the fragrance some dryness and depth, and even though I really enjoy perfumes with an oakmoss note, further in the drydown, this smells dated. I have tried out other fragrances with similar notes, like iris which can sometimes smell old-ladyish, yet in other compositions it can present itself as a really feminine smell, or give a perfume a more modern vibe. This is still a really beautiful composition, but to my nose and for my taste, once again, it smells dated, I think this is an elegant all year round fragrance for anytime of the day, really complex and perfect for someone with a different taste to mine.",
    "author": "reginasniffs",
    "date": "2022-03-30"
  },
  {
    "text": "the iris ruins this scent for me. i loved it on paper but on my skin it smells like old lipstick ☹️",
    "author": "hejjulia",
    "date": "2022-03-08"
  },
  {
    "text": "Fresh, green, spring-like, v surprised it hasn't got hyacinths listed as a note because it really reminds me of them, like when you press your nose into the flower & inhale. A bit colder than the Poudre obvs, more of a spring summer scent. Very classy but for me also has a natural feeling, whether it is or not don't care. So many things these days smell very 'synthetic', or 'chemical' for want of better descriptives (yes we all know all this stuff is chemicals really) but this smells fresh outdoorsy & good for you, as opposed to plasticised n tooth rottingly sweet. Perfect feminine woody floral.",
    "author": "Siv7Stars",
    "date": "2022-03-06"
  },
  {
    "text": "Got the 80s formulation as I was disappointed by how emaciated the current one is. As usual, the Chanel base is apparent, well-made and coherent. Also, the older version is deftly replicated by the current parfum. This I think is commendable considering how people complain about Polge’s reformulations. I do think Jacques had a good understanding of 5, Cristalle and 19 far enough for him to do an intense iteration along with the introduction of Coco. All beautifully done. True to other reviews, this is the rosiest of all versions although I’d think stating more floral would be appropriate. Iris and its rootiness still apparent but more persistent and brave. Hoard it if you have the chance.",
    "author": "jung_yunho26",
    "date": "2022-02-28"
  },
  {
    "text": "A very rich, full, feminine fragrance. To me, this is 100% feminine, its not unisex, but this is a grown up, no bs sort of woman who knows herself, yet she's very elegant and her energy will most definitely arouse and capture you. I see this fragrance made to enhance the feminine beauty and elegance. The fact that this fragrance exists at that price proves that a lot of niche \"luxury\" houses raise their prices just cause they can. This is a great price, yet smells so natural, so detailed, so intricate and high quality. A must try.",
    "author": "IamdrinkingBeer",
    "date": "2022-02-07"
  },
  {
    "text": "I don’t dare read any other reviews of Chanel no. 19, because I’m almost certain that everything that can be said or written about it already has been explored at length. It’s an endeavor both frustrating and intimidating. But then I have to remind myself that I don’t have to be an expert or a guru or ensconced in academia or have years of scholarship under my belt in order to share my thoughts on something so profoundly subjective as fragrance. You Don’t Have To Know Everything About Something In Order To Love Something. I’m not delving into the history of a scent or a house or a nose, I’m not deconstructing the notes and the ingredients; I have absolutely no interest in that, and quite frankly, you can find that elsewhere. I’m just trying to tell you what I think something smells like. So. I’ll tell you that I adore this scent. Intensely sharp and dry and green, with the earthy, rootsy powderiness of iris, the acrid verdancy of galbanum, and vetiver’s leathery grassy woodiness, and that sour metallic tang and bitter effervescence that I always attribute to old costume jewelry; note-wise, I’m not sure where that comes from, but it seems to be a hallmark of these classic fragrances. And it subverts that refined elegance with a punky funk that elevates it to something that feels timeless as opposed to a bit stodgy. The marvel of this scent is its gloomy luminosity, how it's both austere and achingly tender at the same time. It makes me feel a deep nostalgia and melancholic longing for something that never was, for a past I never lived.",
    "author": "mlleghoul",
    "date": "2022-02-05"
  },
  {
    "text": "We were warned month's ago early last year about the possible discontinuations or only selling from the Chanel boutique about Chanel No 19 edp. This fragrance has been sold out for about 6-8 month's now at least and hasn't come back in stock since on the US website. If it's not discontinued at the least it may only be available at Chanel boutique. I don't know if it's permanently discontinued though all the way through. So if you do want this one I would advise if you know somewhere that has it to get it. I got some last stock before it was sold out as early as February-March of 2021 last year when I got word on here this was happening but nothing was certain. After all this time I checked back to see if finally they would be in stock and it's still sold out. If you love this fragrance get it while you can. I see a lot of companies are lowing distribution to other countries. Don't know if this is to control sales, financial issues, supply chain getting worse to meet demands, or it's just not a high seller. Either way, some things you can get grey market and some not. With Chanel there are so many knock-off's I wouldn't risk it. Always go department store from a place you trust is legit with Chanel. Especially with Chanel, Dior & many other high ends. If things change update us please. Chanel No 19 Poudre & No 19 EDT is still available on the US site but not the Edp it's still sold out. I see the parfum is sold out too. Look out for these items sold out. Update: I’m getting word that there are production issues from lack of supply chain. But that Poudre is getting discontinued. The others are not available due to the lack of supply chain so production is backed up like all other businesses. The others will not be discontinued from what I hear. Be on the watch for Poudre then. That one is my favorite out of the bunch for No 19 too. :(",
    "author": "Jacklyn's Perfumery",
    "date": "2022-02-04"
  },
  {
    "text": "Very sharp and out of date. Cannot really understand what this all the fuss goun on around it. There are way much better citrus scents on the market",
    "author": "Arfume",
    "date": "2022-01-31"
  },
  {
    "text": "Silver Shards on Green Earth Chanel No 19 is more \"untouchable\" than beautiful or lovely. It is of the 70s for sure, an austere green fragrance full of woods and earth and lacking any sweetness whatsoever--thank God. Even the florals are cold and sharp, like flowers in a spring snowstorm. How does this feel? It feels woody, powdery, dry, and the Galbanum-Green-Iris-Narcissus-Hyacinth creates a silvery halo effect on top of it all. If you breath in close you can smell roses draped in vetiver and sandalwood, if you smell from afar it's more of a high pitch of stainless steel and hairspray. Living in times awash in iso e super and ambroxan bases, smelling the base of Chanel No 19 is a total reset, and I feel my entire body relaxing--no shrill musky aromachemicals that dagger your senses until you're noseblind, rather there's green vetiver, good sandalwood, earthy oakmoss, the effect is a bit like powdery dry soil--clean really, and all natural. This will be a little scary and \"masculine\" for people that grew up on sweets and gourmands and everything being loaded with tonka and vanilla, and while I love a vintage retro perfume, No 19 actually smells timeless, rather than dated, even though it was made at a time when a perfumes containing leather, woods, herbs, and greens were marketed to women. Iris is in a LOT of perfumes now a days but along with Annick Goutal Heure Exquise, Serge Lutens Iris Silver Mist, and Prada Infusion d'Iris this is one of the most perfect iris scents I've ever smelled. It just makes me feel a certain way--calm and relaxed, and backing Iris against a lot of woods just works. This is no longer available on the Chanel website--I really hope they aren't discontinuing this.",
    "author": "TillyWave",
    "date": "2022-01-25"
  },
  {
    "text": "What to say that hasn't been discussed here? I'll go with my own experience instead. Although I understand as I myself often use it as a suit of armor (the best way to use your signatures in my personal experience: when you need to be yourself), I can't personally relate to the cold steel lady often described: on me it turns fresh, creamy, lotiony, even a little matronly. A total second skin. I can tell the oakmoss is different but it melds so well that I don't care. One of my objectively favourite perfumes of all times along with Rive Gauche and Paloma Picasso. If given the chance to have two signatures listed it would be sitting right beside Aprés L'Ondée, my other unconditional and relentless love.",
    "author": "melusina1982",
    "date": "2022-01-25"
  },
  {
    "text": "I am a lover of green scents and I admire the craftmanship in this fragrance but for me personally it has a too strong vintage vibe.",
    "author": "karinatfragrantica",
    "date": "2022-01-20"
  },
  {
    "text": "I've always loved N.19, It is a classy green woodsy floral..classic and classy mix..love it all year round especially in Spring and Summer...a breath of fresh air!",
    "author": "MimesOtto",
    "date": "2022-01-16"
  },
  {
    "text": "For 3 decades now I was looking for my one and only fragrance. It was a long, exciting, beautiful, very expensive journey that gave me so much joy but also some frustration when I realized that I will never get the peace with my collection unless I stop collecting and start to focus on one fragrance at a time. I know this sounds super weird here but this is how I felt recently. And I was wondering what smell I'm longing the most right now: I had beautiful sweet, smoky fragrances, arabians, ultra-feminine and sultry tuberoses, fresh and creamy modern white flowers, etc. But none of them made me completely satisfied: I layered them not only to make the most out of them but also because none of them felt enough the way they were. It was a special moment when I realized that I need something that is feminine in an unusual but elegant way and that durong my journey there was only one characteristics of fragrances that I've never stopped to love: my greens. Suddenly my old memories on my pre-2000 No 19 EDT came in my mind: it was too much, too sharp, too bossy and leathery for me that time (along with Jacomo Silences) but when I read that the EDP is a rounder, softer, more feminine and more powdery version I knew I have to try it. Here we go. I have a new batch and have no idea how this used to smell and perform originally. What I get now is citrusy, fresh opening, then a green and floral heart and finally a soft, powdery-green drydown. The fragrance has a vintage feel to it, but it is not really dated more of an exciting and very unusual fargarnce in today's trends. It is borderline unisex in my opinion but personally, I can't imagine this on my husband. Sillage is approx. armlength, longevity is good: I applied two sprays at 5 p.m and could clearly get whiffs of it the next morning, or applied at 11 am and could clearly smell at 10 pm. I believe that this longevity and sillage used to be way better (and it definetely could be for the official retail price) but I'm Ok with it as it is and hope that it won't get any worse...... now I feel I'm ready to wear this fragrance exclusively for a few months I find it so exciting and unique.",
    "author": "Agnesca",
    "date": "2021-12-18"
  },
  {
    "text": "How weird this is my first frag after covid and the lost of my smell. I don't detect my usual N°5, Angel, Habanita or Opium but really enjoy N°19 EDP... And in 2021, this gem (as an EDT or pure Perfume) turn 50. This EDP is from the 80es, but Chanel pays it no attention. Let's at least hope we'll be able to get it for a long time. Niche quality and uniqueness in the mainstream shelves.",
    "author": "DomfromBE",
    "date": "2021-12-15"
  },
  {
    "text": "I am heart broken about Chanel 19. It has been my favourite for over 25 years. I took a 5 year hiatus from fragrances and when i bought a bottle again, i feel the remnants of its original is still there...but barely. The EDP used to last 8 hours on my skin and on clothes i could still smell it the next day.. Now it barely lasts 3 hours. It used to be all as described but mostly, a warm fragrance. Warm and cozy, earthy, flowery, woody and lots of beautiful powdery layers. Gorgeous dry down. After the reformulation, it is now a cold, standoff'ish, aloof scent and it breaks my heart because it has lost its warm soul. Ive since bought it in all its versions, including the Parfum, and although still a nice smell.....it has lost its beating heart and soul. I will keep what i have, out of misguided loyalty to Chanel, but i will not purchase again.",
    "author": "Flowerfactor",
    "date": "2021-12-02"
  },
  {
    "text": "I've found most Chanel perfumes old lady smelling and/or overwhelming when I was younger, but I grew to love most of them. N° 19 EDP is my favorite Chanel. It opens with some dry grass and horse piss smell (I'm so sorry, but I pick up these smells), but even that phase is strangely addictive. Then it dries down to the most beautiful, floral-green scent I've ever smelled. It has absolutely no sweetness, it's perfect for warmer spring days and cooler summer days. It is my lucky scent, I wore this for multiple important events in the past (exams, dates, etc.), so my brain links this scent to success, relief and happiness and I feel these a bit every time I smell it. :)",
    "author": "floszra",
    "date": "2021-11-30"
  },
  {
    "text": "I had always been reluctant on No19 as I had always stuck with the safe choice, No5. But when I gave it a try recently, with a much more ready and matured nose, I was surprised how laid back and contemporary this fragrance is! Very chill, cool aunt, who has seen and lived thru the best of the 70's, been to the craziest concerts, and lived a remarkable teenage-20s life, but now has teeny toy dogs and a refined appearance, yet never losing her swag. Anyway, that is how I envision this fragrance. The best of both worlds! The dry down is still green, some hints of flowers, yet it's creamy (idk why I think of this word, but it does) and powdery. How I wish I could buy myself a bottle next time :) Update: My mother gave me a bottle for my birthday. Now a staple in my day-to-day life! Xx",
    "author": "queen.atossa",
    "date": "2021-11-02"
  },
  {
    "text": "If you happen to have Mon Guerlain Florale (now discontinued), spray No.19 EDP on top of it and enjoy. My usual catty i-mean-business No.19 is now defanged by the lovely peony and extra dose of lily of the valley from MGF, and their bases of sandalwood and iris gelds together so well. A No.19 for working from home.",
    "author": "Diari",
    "date": "2021-10-11"
  },
  {
    "text": "I adore this fragrance. It's Channel's masterpiece. Fresh yet complex it is as easy to wear in the day as well as the evening and exudes class. I first encountered it in 1981 in Northern Ireland whilst visiting friends for a wedding. I was a 20year old music student and had no experience of designer clothes or fragrances. The bride wore this fragrance and I had to ask her what it was. It was a few years until I acquired my own bottle. Although I have had No 5, Coco, Mademoiselle, Noir and Christalle, Chance, Eau Tendre and Allure over the years and loved them dearly, No 19 still remains my favourite.",
    "author": "singingsuzie17",
    "date": "2021-10-09"
  },
  {
    "text": "I have a vintage parfum, a kinda vintage EDT, and a brand new EDP. My EDP seems to perform very well! For anyone who was curious about current formulations. The very first spray of my new 100 ml bottle...Jesus. It smelled like very freshly cut green stems that you’re being made to smell. It was intense, and it took about an hour for it to dry down into the green/white floral/powdery perfume that it is. But after a week that intense green stem opening is not there, thank f***ing god I’m quite smitten with it now. Some of the reviews mentioned the word “sweet” as a descriptor and I was almost scared that I made a bad blind buy as I’m a self admitted gourmand phobe. But how far off could it smell from the EDT? It isn’t that different. A little more powder, and the florals are less nuanced in this one. But I still really like it. I’m so unsure as to what my favorite Chanel line is now. Update 01/14/22 - I’ve worn this a few times during these colder months and have really enjoyed it. I really want to score a vintage edp when I can afford it, but my new EDP actually performs pretty decently IMO. I wore it to work today, and did a few spritz on my clothes. I sprayed it on me around 10 am and could still get wafts of it by 5 pm. Also again, I find it so interesting when people describe this as cold. It’s not exactly a refreshing green scent, but it’s...hmm I’m not sure of the right adjective but it IS in some ways fresh to me. It’s also funny because this is starting to become a signature I believe, and cold isn’t the right word for me. I can come off as intimidating, especially because I have a neck tattoo and I have anxiety about how people might be scared of my appearance. But everyone I know talks about how kind and accepting I am, which is also how I feel. 🥀",
    "author": "rosetinteddream",
    "date": "2021-09-14"
  },
  {
    "text": "My no 1 favorite perfume from Chanel! When I think about the note of green notes and vetiver, I thought it would be sharp which I hate sharp perfume, but this is not sharp at all. It is very fluffy, rounded, powdery smooth. It was love at the first sniff. The opening is beautiful fresh green, the dry down is very comforting iris powder. Very wearable in all seasons, it never gives me headache even in the hot summer. I bought two bottles and have been wearing it for 3 years. Big Love.",
    "author": "mlrd217",
    "date": "2021-09-09"
  },
  {
    "text": "Happy birthday Coco! I’m wearing Chanel No.19 Eau de Parfum, in memory of her, the one who started it all. While this was released posthumously of Coco(I think, it feels very 80’s), I think she would’ve loved it. My bottle is current a formulation, with Evernia Prunastri (Oakmoss) listed on the back. For me, I own vintages off both the EdP and EdT and I much prefer the reformations or current versions. The vintages have a staleness that I just cannot get over. It’s one of the cases of “just because it isn’t vintage, doesn’t make it bad”. Rare these days, looking at you Dior. Carrying on, this is stronger than the EdP and sweeter with more rose, lily or the valley, and Iris. It isn’t as unisex, dry, or vetiver/leather heavy as the EdT. It bridges the gap between the EdT and the Poudré and I think it’s masterfully done. This is what I crave! It’s more floral, it’s stronger, richer, and lasts a while on my skin. I have not tried the Parfum/Extrait, but if it’s better than this then I’ll buy 3 bottles! Just checked Chanel’s US website…it’s on Backorder along with Cristalle EdT. Damned shame. Happy birthday, my love. I hope wherever you are, that you are happy and Boy Capel is with you.",
    "author": "invaderlark",
    "date": "2021-08-19"
  },
  {
    "text": "Green but warm. Crisp yet powdery. What a magical concoction! A perfume I wouldn't have touched with a stick 3 years ago, but now I really appreciate it! Swapped my overly raved about Coco Noir for this and have no regrets! Out of the floral notes I get lily of the valley the most, but it might only be because it's an obscure note for my personal taste as I don't gravitate towards it at all so it now stands out.",
    "author": "kkaattjjeess",
    "date": "2021-08-10"
  },
  {
    "text": "This should be a near-perfect scent for me, though I’ll say I have a tough time finding a green that stays but doesn’t smell like a highly peppered vetiver man. Is something wrong with my nose? I am dying over the opening, but very shortly thereafter, it’s all iris and powder. Green gone.",
    "author": "Stillmagnolia",
    "date": "2021-07-30"
  },
  {
    "text": "This is really good, like a vintage greenish mossy earthy scent for an everyday use but also if you want and can for a night time as well.",
    "author": "ayken",
    "date": "2021-06-30"
  },
  {
    "text": "I'm usually someone for the WOW perfumes that blow me away. This is nothing like that. It is a subtle perfume I can't place. I guess I have to get used to the non-overpowering aspect of it. The more I smell it, the nicer it gets. For sure something different, in a good way.",
    "author": "etmpewo",
    "date": "2021-06-30"
  },
  {
    "text": "a sour green fragrance. nothing else at the beginning. then it opens but it is not shocking maybe a little pink soap effect, a light iris and a good dose of narcissus, the lily of the valley makes it very soapy. for the rest a touch of ylang ylang. the neroli is overwhelmed by the other flowers. it is a perfume with a very slow evolution. unisex? no. for me no. contemporary for me no. I see it on a woman over 60. 6/10 good longevity but poor sillage.",
    "author": "lovetribe",
    "date": "2021-06-12"
  },
  {
    "text": "Aldehydic biting acrid green. I have conditioned myself to aldehydes through exposure therapy, but i still struggle with the cold green style perfumes. That being said, this is a masterpiece. The drydown for me is the best part where it starts to approximate the amber green of 31 Rue Cambon.",
    "author": "Callista25",
    "date": "2021-05-30"
  },
  {
    "text": "A very, very dry powder with smooth, deep green notes. The green is neither grass nor leaves nor tea - kind of unspecific but skillfully blended and never flat. The scent is rather intimate but fresh. I can see it on people in many age groups and of many genders. No. 19 is not flashy, but a classic that I find just as suitable to wear in a professional setting as on a date. Unfortunately, No. 19 didn't last too long on my skin: just short of 4 hours until the magic was gone. Still, I do recommend this unisex, timeless beauty.",
    "author": "Eribert",
    "date": "2021-05-20"
  },
  {
    "text": "I swear, sometimes I think LT writes an essay just to enjoy his own snark. His description of this fragrance as a heartless “wire mother” made me hesitate for years to buy it, even though all the notes seemed to add up to something I would adore. Well, after dipping my toe in with Poudre and loving it, I dove in and bought the OG. And guess what? It’s beautiful and smooth with the sweetness of nature in springtime, and not a wire hanger in sight. It has the same balance between bright and the hint of darker sweetness that 31 RC has- a very beautiful balance and very satisfying. For green and iris lovers it’s a no brainer, get it in your collection, it was absolutely a safe blind buy. Ps. I too smell mint. Very natural, the sort that was sprinkled through my great aunt’s yard when I was little.",
    "author": "Violinplayah",
    "date": "2021-04-16"
  },
  {
    "text": "Does anyone have an unwanted bottle? I am interested!",
    "author": "dsantiago02",
    "date": "2021-04-12"
  },
  {
    "text": "I went through a 50ml full size of this in my 20s when I lived in a tropical country, primarily because I wanted to smell \"boss lady\" like. It is a very sharp green scent, very watery/dewy in the opening with a strong \"grassy\" vibe, and the dry-down on my skin is quite powdery. If you like green perfumes, this is a master piece - very well blended, complex and sophisticated. Fast forward to almost 10 years later I am happy to realise that I like neither green nor powdery note in my perfume, and that I do not have to use a certain perfume in order to be recognised as an independent and strong woman in life. I just use whichever perfume that suits my mood for the day.",
    "author": "Murmur123123",
    "date": "2021-04-11"
  },
  {
    "text": "This has been my love since forever. It opens with a very sharp green aspect, kind of a cold one. You can feel the flowers coming through but still with that green aspect. I do not believe in genders when it comes to perfume ( I wear mostly \"female\" perfumes), but if a man is in doubt about this one, go for it! It has similarities to \"male\" perfumes.",
    "author": "Kitojj",
    "date": "2021-04-10"
  },
  {
    "text": "9.25/10. This is my favorite perfume. I have been putting off this review because it is hard to be objective. No.19 was my first serious perfume after college and I have loved it since. Primal addiction. Like No. 5, but with floral on top and cologne, musk and spicy clove underneath. A pleasant bitterness in the middle. Very well blended. Older but not dated. It is not completely perfect. If falls just short of paradise which has led me to search other perfumes but short of Coco Noir, which is very similar, nothing quite makes it.",
    "author": "blossomka",
    "date": "2021-04-08"
  },
  {
    "text": "This is a boss scent. Earthy without being dirty, green without being medicinal. Just perfection. Best green fragrance for sure. The devil might wear Prada but when it comes to perfume she for sure wears Chanel No19",
    "author": "Mariana Arias",
    "date": "2021-04-07"
  },
  {
    "text": "Opens green, dewy and bitter. As it dries down it starts to loose its dewiness and becomes more dry and powdery. In truth, I was hesitant to purchase this after seeing so many reviews from men who love it and wear it frequently. I thought perhaps it was masculine and wouldn't quite translate to my more feminine palette. But after having experienced it I believe anyone can wear it. In fact, on my skin it doesn't skew masculine at all but is powdery, feminine, and serious. It's a bit perfumey as it dries down though I predict a lighter hand on spraying may mediate this a bit. It isn't cold as I expected either but is quite warm, soft and moderately green. I can still sense oakmoss at the heart of its dry down but it isn't dewy anymore, more dried and reminiscent of plant stems...unless that's an entirely different green note altogether. I also tested the dry down on paper as I wore it on my skin and the outputs were a bit different with the paper dry down remaining linearly cold, green, and bitter for a lengthy period of time. I'd suggest it be tested on skin if being sampled. Ultimately, I wanted a green scent I could find elegant and wearable in many settings and dare-I-say, I found it.",
    "author": "CurrencyThat",
    "date": "2021-04-05"
  },
  {
    "text": "You know more than 10-12 years ago there is no way I could of enjoyed a fragrance like this. I just wasn't experienced enough with fragrances and my nose hadn't developed enough. When I first got into green fragrances I hated them and just put them to the side. Now I have adapted and enjoy them so much so that I want to collect them when I can especially if there is a chance of iris being in them. This fragrance is glorious. I got Chanel No 19 Poudre first before No 19 because I knew I wasn't ready for it and I wasn't. I'm so glad that I did that because now I adore this fragrance. It is the epitome of Springtime. It's dense and has way more green galbanum than Poudre, but it has citruses and powder from the iris. No 19 has a bit of sunniness coming from the ylang ylang and narcissus along with the lily of the valley. The iris is similar to Poudre but not as intense. So over all this is a dense greener colder version of Poudre where as Poudre is sweeter because of using more of the iris and yet not as intense on the green. The fragrance is gorgeous gorgeous gorgeous. I don't know why I waited so long to get it..but when I heard there could be a possibility of it being discontinued I knew I had to have it just in case. I couldn't see myself without it. If you love green fragrances I highly suggest you try these two and I'm thinking of getting the EDT in the future just to experience the original No 19. Also try Frederic Malle's Carnal Flower, The Vagabond Princes' Swan Princess, Prada Infusion D'Iris, Maison Lancome's Iris Dragee & Figues & Agrumes, or Mugler's Aura. Many of these are similar with Carnal Flower, Figues & Agrumes & Aura being the most different of the whole bunch besides the Chanel's but very much green. I have them all but Swan Princess and maybe one day I will own that one as well. Anyways, if you are a lover of green fragrances Chanel No 19 is a must have and I can see why it was Chanel's favorite perfume.",
    "author": "Jacklyn's Perfumery",
    "date": "2021-03-31"
  },
  {
    "text": "Does anybody know if this beauty is going to be discontinnued? I have heard that you can only find it in Chanel boutiques but for how long? I am teriffied I love it profoundly",
    "author": "FRAGRANTICA13",
    "date": "2021-03-22"
  },
  {
    "text": "I have discovered this 2 years ago and I am in love with it. It is like an introspection or meditation in nature. It makes me feel self centered",
    "author": "FRAGRANTICA13",
    "date": "2021-03-22"
  },
  {
    "text": "The bottle may be a light, fresh green colours, but the actual perfume smells like what I imagine dark green would smell like. Reminiscent of a dark forest after days of raining. Earthy, green, no sweetness.",
    "author": "lmnsvgz",
    "date": "2021-03-20"
  },
  {
    "text": "a été longtemps un de mes préféré, mais me suis lassée, très frais, ris bien présent mais parfum pas lourd ou poudré; convient par temps chaud; mixte à mon avis, peut faire l'objet d'un blind buy; n 'incommode pas, passe partout",
    "author": "lyka",
    "date": "2021-03-19"
  },
  {
    "text": "Sharp, glorious green and gorgeous. Very cool, icy, chic. This lovely fragrance does have the beautiful iris note throughout. Soapy, clean, crisp. Forever a classic.",
    "author": "Henglertdavis",
    "date": "2021-03-12"
  },
  {
    "text": "Oh boy, do I just love Chanel! Yes, it starts off a little strong. If you judge a perfume by its opening then maybe it’s not for you. But the dry down is STUNNING. It really is. And it gets lovelier the longer it stays on your skin. It’s beautiful, crisp, elegant, soapy, and calming. Made in 1970, it’s very evocative of its time. A simpler time. A time of confusion; one grasping for semblance and direction. Much like today. This fragrance is the ultimate GREEN. It’s synthetic green, natural green- it’s all green combined into one. No. 19 is the “alternative”. It’s the cool, chic cousin of No. 5. It’s CLASSIC and always will be. Don’t be fooled. This is not for somebody who only ever covers modern, citrusy, sallow fragrances. But it’s a classic fragrance you can still get behind and fall in love with. If you No. 5 has never been your thing, maybe this is for you. Maybe it’s your “classic” that you’ve been looking for.",
    "author": "LittleBlueBox",
    "date": "2021-03-10"
  },
  {
    "text": "It's so unusual, I'm not sure about it. It's not that it's an unpleasant smell, it's just so hard to pinpoint a single note in it that my nose gets confused. I think this is one of those scents that you have to wear in the perfect climate, on the perfect day, in the perfect mood for it to be truly magical. Not sure I've hit that trifecta yet.",
    "author": "jadepo21",
    "date": "2021-03-10"
  },
  {
    "text": "I was hunting for a bottle of Chanel no. 22 ( inspired by anne rice's Merrick, from her vampire chronicles). Anyway, I was not disappointed when I came across this bottle instead! I just realized I have this love affair for chypre fragrances. Though I haven't smelled the original which I need to find, this seems good enough for the moment. Subtle, airy, elegant, green, clean soapy with notes of grassy vetiver and orris root! It is divine! I'm quite surprised at how this was marketed towards women, when this actually can pass as unisex ( but again EVERYTHING IS UNISEX). I wonder if there would be a masculine hype if this was renamed \"chanel pour monsieur no.19?/ chanel homme no. 19???\" haha ( the wonders of marketing). From the beginning of the year, my perfume tastes have now veered towards unisex and women's marketed fragrances that men can pull off. Projection is on the intimate side (or am I getting anosmic immediately, I do sense an intimate clean green aura about me still). Thinking of purchasing the EDT, but I'm having longevity issues with the EDT when I tested this out. I immediately was greeted by a blast of alcohol on the test strip before smelling the fragrance though. On skin it seemed to vanish immediately. If this fragrance gets to me after a week of wear, I might just purchase another 50 ml bottle! UPDATE (3/2/20) : I purchased another 50 ml EDP as my travel bottle in less than a week as promised. (yikes) The Sales Rep said the bottle was indeed meant for me, as when she opened her stock cabinet, there was only one EDP bottle left in a 50 ml size! Our chanel boutique here won't be restocking soon. Is it just me that I get different facets of the fragrance everytime I wear it? Sometimes I smell the leather, sometimes I smell the florals, and sometimes I just smell the crisp greeness? I love how transformative this fragrance is!",
    "author": "880267",
    "date": "2021-02-27"
  },
  {
    "text": "This is the one perfume that people always comment on favourably when I wear it. It's very unusual and develops into warm, rich, earthy tones the longer it's on my skin.",
    "author": "Alison333",
    "date": "2021-01-21"
  },
  {
    "text": "Beautiful and unique.",
    "author": "temo",
    "date": "2021-01-15"
  },
  {
    "text": "The initial encounter reveals the sharp bergamot/neroli duo that travels through your olfactory senses, abruptly awakening your brain into a rapturous stupor of ... green and, most undoubtedly, at this point you know it's \"a Chanel\". The opening is freshly cut green, green, healthy grass. It's bright, astute, sparkling, daring, afraid of nothing and then it disperses, allowing the motley of flowers to sink on my skin. Each of the flowers dance in perfect harmony, taking turns under the spotlight - quite beautiful and vintage (here's your powder), somewhat melancholic and reminiscent of bygone years. The dry down is a combination of leathery vetiver and even a little soapy (very much a-la-Chanel). My skin exudes more flowers than green, which is a shame but not a deterrence to continue wearing it. Overall, a lovely composition and worthy of being a signature scent to many, yet I am not impressed. Do I need it? No. Am I glad to have it in my collection? Yes. Definitely give it a whiff or try it on before you let your precious coins leave your wallet.",
    "author": "brenvillasana",
    "date": "2021-01-13"
  },
  {
    "text": "I’ll start by saying that I only just discovered this website and am fairly new to the world of fragrance. I love reading the well informed and passionate reviews on this site about this art form that I am only just learning about. For Christmas I received a bottle of Chanel 19 EDP from my generous sister-in-law. Based on reviews, I had mentioned to her that I wanted to try it. In the past, I have loved fresh green scents. I also love the initial sharp “bite” of Light Blue. I thought No 19 would be a perfect fit for me and was delighted when I opened it on Christmas morning. I sprayed once, below my left ear, and... disappointment! To me, it smelled of old grass clippings tucked inside an old cosmetics bag. Based on what I’d read, I knew to wait and give it a chance, only to have transition into a hairspray scent. I had to wash it off after a couple of hours, I couldn’t take any more. I went to bed disappointed and crushed that my sister-in-law had wasted her money. The next morning, when I put on my robe, I was greeted by the most HEAVENLY scent. Gone was the loud, headache inducing green smell. Instead, I kept getting whiffs of gorgeous light floral woody loveliness. Light and classy. LOVE! I don’t know if it is something about my skin chemistry that is not a match? Is this common? I’ll keep the bottle to lightly spray on clothing. Chanel No. 19 is amazing, but don’t assume you can wear it...try it first. I hope you are luckier with it than I was!",
    "author": "Beachgrass",
    "date": "2020-12-27"
  },
  {
    "text": "I tried no 19 after having used no 19 poudré for a long time. It can be best described as a sharper, grassier version of 19 poudré. It misses the sweetness and softness and is mostly harsh. It is not a perfume I would wear myself, but I understand the appeal.",
    "author": "frangiris",
    "date": "2020-12-27"
  },
  {
    "text": "This one disappeared off Chanel's online store in Canada and I just got an email from them confirming that it has been discontinued. If anyone has a bottle they don't want, I'd be happy to take it off your hands :)",
    "author": "renashepet",
    "date": "2020-12-22"
  },
  {
    "text": "If this were a painting it would be \"Madame Chocquet Reading\" by Renoir. This is a serious yet feminine perfume. The green notes are very real--bitter, vegetal, and deep and the iris is leathery and almost medicinal. Iris has been described by some as smelling like paper cash, and I think that is true in no 19. This is highly feminine but not girly. It starts off very bitter and over time starts to become more floral and powdery. While this is not a playful or frilly fragrance, the behavior of the actual perfume billows. I get wafts of it and it is so comforting in a restrained and stoic way. While this starts to get more floral and feminine, it never loses its edge and that very bitter green galbanum note persists from start to finish. The green notes in this remind a little of Critstalle, but no 19 does not have nearly as much oakmoss. Instead, it has more of a powdery leathery iris note that grounds it. I have never smelled anything like this perfume and I highly recommend getting a sample or decant because it is worth checking out even if it is outside of your comfort zone.",
    "author": "personalskin2520",
    "date": "2020-11-18"
  },
  {
    "text": "@blondiecurls Thank you for finding out about availability. I managed to find a 100ml bottle in a local chemist after my post. Glad to see that it’s now back in stock with most retailers. Phew. No need to panic anymore.",
    "author": "Janey53",
    "date": "2020-11-17"
  },
  {
    "text": "Long lasting and very green, watery and fresh. Grassy and lovely. I can imagine a calm woman wearing this on a spring morning. The only perfume where the initial spray, the middle notes, and the dry down smell the same.",
    "author": "Coffeeandperfume",
    "date": "2020-11-11"
  },
  {
    "text": "It's green and soapy (sometimes powdery), with a heart of timid flowers veiled by sharp vetiver and green, resinous galbanum, almost but not quite to the point of being bitter. Some would describe it as cold and heartless, as it is office-friendly in a way that it would turn people's heads and make an impression that you mean business as you walk into the room. I heard some people saying it's fresher than No.5 and not as much of a \"femme fatale\", here I have to disagree. No 19 was in fact the final perfume approved and worn by Coco Chanel herself before her death in 1971, with the formula originally created for Coco as her personal signature scent (19 being her birthday, August 19 1883). If No.5 is what Coco envisioned what \"a woman's perfume with a woman's scent\" should be, No.19 is Gabrielle Chanel the woman as an individual: studious, stubborn, austere, and cynical in a French way. I always think of her last words directed at her maid when I wear No.19: \"You see, this is how you die.\"",
    "author": "Diari",
    "date": "2020-10-31"
  },
  {
    "text": "The Parfum, Eau De Toilette, and Eau De Parfum are still in production",
    "author": "PurrParfumFan",
    "date": "2020-10-06"
  },
  {
    "text": "@janey53, I contacted Chanel about whether No 19 EDP has been discontinued and it hasn’t been thank goodness. Maybe Covid has interfered with production but Chanel are working on making it available. I hope this helps if you haven’t received a response.",
    "author": "BlondieCurls",
    "date": "2020-09-16"
  },
  {
    "text": "Realized I could be a \"boardroom bitch\" because I freaking love this scent. (Did Luca Turin call it that?). It knows what it is and it's awesome, no apologies, so deal.",
    "author": "annelisemaurer2560",
    "date": "2020-09-15"
  },
  {
    "text": "Reviewing a 2018 batch. I'm back to update this review because I realised that the very first bottle of Chanel No. 19 that I purchased about 30 years ago, was an EDP. It took me a long time to finish it. The vintage EDP is drier and more punchy. The 2018 EDP is a tad sweet. It's not as strong as the vintage, but it's still good. There is tiny metallic note in it which did not exist before. That may be due to the change in ingredients. Comparing the 2018 EDP to the 2019 EDT, the EDP is closer to the skin, the notes are flatter, it's a tad more powdery and it comes across more mature and serious. This is a green floral chypre although, Chanel 19 doesn't consider itself a chypre. There is a subdued aldehydic blast in the EDP. If you wear this perfume, you don't care what other people think. It's an independent, courageous and forever stylish fragrance. Coco Chanel's personal fragrance. The original formulations were the Parfum and EDT. The EDP came later. I usually wear the EDT. I recommend purchasing the EDPs in Chanel now, to fully experience the perfume.",
    "author": "AnaisLouLou",
    "date": "2020-09-12"
  },
  {
    "text": "Okay, I thought I’ve seen it all but hell how wrong I was! It was right in my face in the past few months, didn’t even give it a go cause I was so far away from the no 5 I thought what’s the point?! Then yesterday I came across it and I started to read your reviews! I was stunned how many people is in love with this perfume so I went to the pharmacy and sampled it alongside of the new No 5! So.. the first spray is more then horrible! But wait about 10-15 seconds! Then the magic starts to happen but it’s still not quite what I wanted, but you know what, girls got to do what they’ve got to do I’ve got it cause deep inside I had a feeling on my skin it will be glorious! And it is so so so beautiful, delicate, but still charismatic! Quickly became my signature perfume for the Irish wet Autumn/winter season! I’m super super happy! 👏🏽💗 Longevity: 8/10 Sillage 6/10 Scent 10/10 👏🏽 Uniqueness 10/10 I would add to my feedback, not many people wears this scent cause they put off by the opening scents so it’s great news for those women like myself who doesn’t want to smell like every second person. 🙈",
    "author": "Naomie",
    "date": "2020-09-10"
  },
  {
    "text": "Chanel No 19 Eau de Parfum is my all time favourite scent. Does anybody know if it has been discontinued? I can't find any online stockist in the UK where it is available. I'm awaiting for a reply from Chanel, having sent them a direct message. I'll be gutted if I can't buy this beauty anymore.",
    "author": "Janey53",
    "date": "2020-08-26"
  },
  {
    "text": "This is a very classic, a very modest, a very beautiful, a very Chanel fragrance. It is the only Chanel that I own - yet. I love a few more, so if it will be in any way possible, I will get them. If I am ever going to spend lots of money on one expensive perfume (or edp or edt most likely) it will for sure be on a Chanel. Guerlain is equally classique, but not that expensive at all. Then of course - even Guerlain have special editions with Extra Price, as have Lancome and many others. And many fantastic niche fragrances, with fantastic niche prices. Maybe with not so fantastic end results after all... no, Chanel it will be, for my wedding and my honeymoon. ( Then there will be the job about to find the dreamy right fragrance for the groom as well. That will be fun.) However and anyway, I was really surprised when I found out that no 19 has not been out for longer!! I was almost sure that I had felt this perfume on someone in my early childhood, in the sixties. But obviously it was not even invented back then. Well, I guess that someone had at least something that was like it. It is very mossy and dark green, but springtime mossy and green. Subtle, soft and mild, and a low key but selfassure diva. I love it, but I use it sparingly. It has to be treated with respect. From this; springs Chanel no 19 Poudree. Another fragrance, a sister, a daughter. That will be my wedding perfume..! Chanel no 19 - this original - I wear for its own sake. When I am in the right mood to appreciate it for what it is.",
    "author": "Miasha",
    "date": "2020-08-22"
  },
  {
    "text": "caselizas perfectly illustrates what is lovely about this fragrance. It's wet, mossy, leathery, a great oakmoss, very complex. This is really lovely -the smell of a forest after the rain. 7/10",
    "author": "bintTapputi",
    "date": "2020-08-15"
  },
  {
    "text": "love this, layered with Prada's Infusion Iris....exquisite!!!!",
    "author": "soldier71",
    "date": "2020-07-23"
  },
  {
    "text": "This is the best Chanel! The scent opens with a burst of intoxicating green scents that are so fresh and clean. As it settles the iris creates a nice subtle powdery fragrance that mixes with the rose and lily for a scent that is sophisticated and elegant. It is clean, green, and versatile! It works with any weather and any clothes. It is divine!",
    "author": "AMH19",
    "date": "2020-07-21"
  },
  {
    "text": "Five years ago, I smelled this at a Chanel counter in Sephora, and I was polarized by it. I legit thought it smelled like grass. I absolutely hated it. Now, it is one of my favorite perfumes of all time, especially with burnt oud wood, I feel magical when I wear it. Girls, this is the type of perfume that shows you you’ve grown up.",
    "author": "JillValentine",
    "date": "2020-07-16"
  },
  {
    "text": "Sigh, another case of the blind-buy blues. After hearing so much about the revered Chanel No. 19, I was convinced this was the next fragrance that I had to have, in my never-ending quest for the perfect green fragrance. Forgoing all logic and reason, I went and purchased this without ever smelling it. My mistake. To start with the positives, this fragrance does give off a very stately, feminine presence. I imagine some upper middle class no-nonsense woman in head-to-toe J. Crew, on a business retreat during a Northeast summer. She's happy, but she's also deadly serious. From the note breakdown above, don't be fooled by the \"green notes\" at the top--this is an iris fragrance through and through, perhaps just a short lived green freshness in the opening. It's not a lush green forest, or a bitter, leafy green, but slightly wet and dewy. Like a freshly misted bouquet of irises. A fresh iris lingers for a while, before it settles into it a very vegetal, carrot-like iris. This is when the vetiver reveals itself and the fragrance goes from nice to horrible. On me, the dry down actually is very similar to Lalique's Encre Noire, which I loathe. Something about vetiver-dominant fragrances is unbearably sour to my nose, and I've never been able to make it work on paper or on my skin. I'm not sure if it's synthetic vetiver or a combination of vetiver and synthetic woods that is so nauseating, because vetiver in smaller doses has never bothered me in other fragrances. I've had this fragrance for a few months now and unfortunately after many tries, this is just not something I would ever find myself wearing. If you universally love iris and vetiver, this is for you. If you're looking for the ultimate green fragrance, I suggest looking elsewhere.",
    "author": "ateneo_ldb",
    "date": "2020-06-02"
  },
  {
    "text": "Very pretty scent with almost no sillage or longevity . Price is a rip off and Chanel seems to have no commitment to quality these days .",
    "author": "annxyz",
    "date": "2020-04-30"
  },
  {
    "text": "More floral and ladylike than the edt. This was the version of the chic and classy N19 from the 70’s, updated to the 80’s standards. Here we have the green opening notes that made the original be a trendsetter, also the rose de may, jasmine and ylang-ylang but the orchestra is ruled by the powdery iris. That set this apart from the edt. N19 eau de parfum is way more floral and powdery and I dare to say it’s better suited for evenings. It exudes class, elegance and joy de vivre in a very French way. Wear it and you will feel like walking along Champs-Élysées wearing a green coat a cashmere scarf and dark glasses. Chic like a glass of champagne staring at the sunset in the Seine!",
    "author": "Dcarlo",
    "date": "2020-04-30"
  },
  {
    "text": "Classy and green. One of my favorite designer feminine fragrances. This is a delightfully green and somewhat powdery feminine fragrance. Greenery with iris and oakmoss settled in the background with a touch of vetiver. Perfect for spring and would be a wonderful, inoffensive but intriguing scent for the more reserved lady. This is not loud or obnoxious and it certainly knows which one is the salad fork. Overall performance is poor. Typical lately with Chanel fragrances, it sits close to the skin with minimal sillage. Longevity is satisfactory. Unfortunately, such a wonderful scent that can only be enjoyed if very close to the wearer. Scent: 10/10 (Outstanding) Performance: 3/10 (Poor)",
    "author": "EnterTheDarkness",
    "date": "2020-04-15"
  },
  {
    "text": "This is a very green fragrance! It manages to perfectly blend the notes into an intriguing scent that smells divine! The opening can be taken as slightly bitter for some, but I get a beautiful green scent mixed with an intoxicating and fresh quality that smells so elegant. As it dries down the mossy notes and earthy scents makes you smell and feel fresh, clean, and beautiful.",
    "author": "Lauren19",
    "date": "2020-04-09"
  },
  {
    "text": "I love it! Calming and refreshing!",
    "author": "Cameo Autumn Noelle",
    "date": "2020-04-07"
  },
  {
    "text": "This is a wonderful fragrance for spring. It’s the ultimate sophisticated green scent fragrance for ladies. The fresh green notes of the initial spray are fabulous. After the dry-down, I get classy leather notes that smell like a luxurious leather bag. It’s not for a younger lady who prefers a sweeter or more girlish approach to a warm weather fragrance. This is for a career woman in her 30s and over. Very professional. Now the downsides. I don’t know what happened with the house of Chanel, but their fragrances now have really abysmal performance. It’s not just this one. Everything is so watery and dries down to skin scents. I have to spray at least 6 times to match the performance of a Guerlain or Dior. I’m not getting nose blind either because I only spray once for edp concentration scents like Absolutely Blooming or Shalimar, or twice for Miss Dior. This has its upsides since I can use them freely during the summer since they’ve become weaker. But I never take a Chanel out in the winter except for a parfum concentration, or maybe something from the exclusif line where there are some better hitters. I used to love no. 19 because it filled up a room. It never does that anymore. So, it’s a like from me. The scent is a masterpiece, but the performance is bad.",
    "author": "jjoyce2",
    "date": "2020-03-21"
  },
  {
    "text": "I have been wondering what to write and how to review this perfume as it is such a difficult fragrance to put into words. This perfume is what you would imagine a French perfume to smell like. The scent is linear and the main notes I pick up are leather, oak moss, vetiver and lime (bergamot). It can lean a bit masculine. Unfortunately it doesn’t project too far, you would have to be really close to the person to be able to smell it. Longevity is about 9 hours. I still have not made up my mind whether I love it, hate it, like it or if I am just indifferent towards it but there is something about it that feels mysterious and keeps drawing me in as if there is more to it the more I wear it. It smells clean in an earthy grassy herbal way. I can conclude that this is an interesting perfume.",
    "author": "ticalica",
    "date": "2020-03-15"
  },
  {
    "text": "I'm returning to my 3 favourite Chanels: 5, 19 and Cristalle. Just heavenly. Definitely getting old...",
    "author": "bevren",
    "date": "2020-02-25"
  },
  {
    "text": "SKIN. CHEMISTRY. I have sniffed No 19 at every single Chanel counter I have ever been to for YEARS. always just sniffing the sprayer, thinking it was fresh and gorgeous, but too sharp, too crisp, all lines and angles, too green to go on my skin. It always got loaded on a tester strip and flung in my bag - nearly all my purses smell vaguely of 19. Today, I left the house without perfume on (horror of all horrors) and all I had in my purse was a rollerball of Chloe EDP, which I just could not face today. So I swung by my friend's store to get a few spritzes of 19 Poudre, my current works-any-day fragrance. Absentmindedly, I picked up the wrong bottle, and I suddenly had four sprays of Chanel No 19 EDP all over me. I panicked. I thought, oh no oh no, it'll be too strong and too stark and I have a meeting omg omg. I drove with the windows down to try and get it to waft away. A 30 min drive later... I got to my meeting smelling like perfection. I'm about to use an unexpected word on 19: creamy. Creamy! Were you even ready?! Were you ready for me to call it CREAMY, of all things? Something (I'm pretty sure it's the sandalwood) has softened the edges on my skin, and turned it into everything I had ever wanted it to be. It's green, yes, and it's cold, yes, but it has no 'bite' on my skin. I am so amazed. It's not a hug, but it's a kiss on the cheek. I expected it to be a blank stare. Elegant and aloof, I feel like maybe 19 is one of those perfumes (or women) who appears cold and unyielding, but warms to a select few, in confidence, with that modest sillage she's got. As for longevity, still on my wrists faintly, and still on my shirt very noticeably, 7 hours later. I went back and bought 100mls right after.",
    "author": "angel has a problem",
    "date": "2014-06-17"
  },
  {
    "text": "So, I deleted my previous review about the longevity of this scent. That doesn’t mean it doesn’t have longevity issues, because it truly does, but I found a remedy in my situation. I’m passing it on here in hopes that this may help to spark ideas for you. I was reading reviews and I came across one where the reviewer stated that in order to correct the longevity problem that they were having, they simply layered this over Molecule 01. That got me thinking. I don’t have Molecule 01 but I do have Perfect Veil in the roll on perfume oil. I thought, what do I have to lose by trying it out? I mean, nothing ventured, nothing gained, right? The worse that can happen is that I don’t like it. This morning, I decided to give it a go. First, I very lightly applied Perfect Veil, then I sprayed this over it. The result? Absolutely DIVINE! The scent is truly ethereal AND it lasted all day long. I got whiffs of it through out the day. Perfect Veil added just a touch of sweetness to it, but other than that, it didn’t alter the scent. So very glad I tried it. Edit to add: I read other reviews stating the opinion that this scent smells like it is for a cold hearted, calculating, wire mother, total bitch of a woman who is venomous, poisonous, hissing, and down right vicious who would chew you up and spit you out across a boardroom floor.. I don’t know about Gabrielle Chanel, but anyone who knows anything at all about me knows that description doesn’t fit me at all. The truth is, that is not at all what inspired the making of this scent. I’ve read that this scent was inspired by Chanel’s weekends spent in the French countryside. Namely, the country house that Chanel owned, Bel Respiro. It is no wonder that fragrance in the Les Exclusifs line smells somewhat similar to this. This is an earthy scent inspired by nature and the earth, not by the kind of woman some may think Chanel was. Because of those kind of reviews, it stopped many from even trying this beautiful scent. I don’t find anything evil or cold hearted about this scent. I do, however, wonder about these reviewers’ intentions when writing such reviews though. It’s one thing not liking a scent. We all have likes and dislikes, but to use tactics like expressing that only an undesirable type of person would wear such a scent is a personal attack on those who love and wear this scent. As for everyone else, don’t take just my word for it. Try it yourself and see what you think.",
    "author": "ChelleBelle84",
    "date": "2022-09-27"
  },
  {
    "text": "When I met No. 19 I was surprised. She was nothing like the perfume people talked about. All the rumours about her being harsh, sharp, strong, bitchy and wearing a suit made me think I ran into a wrong perfume. I was expecting to see someone stand offish and rude, instead she looked at me and offered a calm cup of tea away from the crowd. I had to apologise for my surprise, I said I was expecting her to be imposing and cold. She said she'd heard the rumours herself and finds them slightly amusing. No. 19 is clearly spoken but quiet, condifent in herself but not making a show out of it, her voice is calm and soothing, and she encourages you to trust your own instincts. She doesn't wear heels or sharp suits, she doesn't tap red nails on a board room table, she doesn't need that. Instead, she finds a place where she feels comfortable and in peace, she doesn't like attention but she will stand her ground and pick what's best for her. Often, she will stand looking at a field or a river, breathing in and out the fresh clean air. She doesn't want flowers or bright sunlight, just clear air and calm internal peace. The only thing I found that makes me sad about No.19 is that she doesn't stay around for long. Maybe a couple of hours and she will be gone, no trace left behind, until we meet again.",
    "author": "gugute",
    "date": "2018-11-17"
  },
  {
    "text": "Fantastic. Mindblowing. I will not reinvent the wheel here in stating that the EDT is sharper, colder, fresher, more \"dynamic\" while the EDP is slightly less green, and more powdery with a hint of sweetness, fuller and more luxury feeling. As a man, I would wear both, even if the EDT is for sure easier to pull off than the EDP, and definitely easier than the newest EDP Poudré (that one is definitely feminine). As a man, I have a slight preference for the EDT, but the EDP performs way better. Dilemna... To women, I'd recommend the EDP without hesitation. Spring days, 25+",
    "author": "Andy the Frenchy",
    "date": "2019-09-25"
  },
  {
    "text": "Having never smelled this before until recently, I knew it would be something I'd enjoy since I love dioressence, mitsouko, and givenchy III. What I didn't expect was to be transported back to sweet memories of my father's mother. She wore this. NO doubt in my mind.. My mom used to say she wore Halston. But no, it was this. I spritz this on my skin and I'm immediately reminded of her hugs. She was a classic, elegant New Orleans socialite to the fullest. Always looked her best, loved throwing dinner parties, and visiting her friends in New York. No 19 was made for her! I plan to wear this scent for the rest of my life in honor of my meme and of course for Coco herself. It is a true pleasure to be the kind of woman who can pull off these icy cool, earthy scents.. You can keep your sweeties and sweaty ambers. Give me IRIS AND OAKMOSS!",
    "author": "jana.hullinghorst",
    "date": "2015-08-14"
  },
  {
    "text": "I am a man and I wear this. I find it very masculine. It is exquisite. To me, it smells like summer in a natural environment. Very green and somewhat woody. I wear it when I go out during the day. I have received numerous compliments. Some of my friends were surprised to know that it was marketed for woman. A true gem. 5/5.",
    "author": "yourfriendmarito",
    "date": "2015-05-25"
  },
  {
    "text": "What in the world has happened to this classic green fragrance? I tested a mini of the reformulation and couldn't believe what's been done to No. 19. A pale shadow of the former glorious perfume, the reform is an insult to those who know and love the vintage. The \"new\" No. 19 smells like one of those cheap impostor fragrances, if not worse. I can't believe Chanel approves and sells this ... No. 19 was one of my mother's stand by fragrances, along with some Dior's. As a kid I'd sneak a few drops from the elegant flacon with the pale green liquid and marvel at the sheer beauty of the elegant, sophisticated scent. No. 19 was the cool counterpoint to the more popular No. 5, a younger sister but never inferior to the older beauty. I still can't believe it's gone.",
    "author": "Phantomias",
    "date": "2019-05-04"
  },
  {
    "text": "Sharp greens, earthy oakmoss, dry powder, leather, bitter and high pitched. This is instant first class, high society. If Chanel No.19 would be a woman, she would be high collared, prude, intelligent, obtained a high position, strong, independent, always right and says \"no\" to everything. She is the female boss you hate yet envy. No.19 have get-togethers over fancy lunches, give the poor waiter a hard time, and gossip pouring out of her cruel yet sophisticated lips. While this is pleasant to some, I can appreciate No.19 but I cannot stand to wear this.The notes and I don't agree.",
    "author": "Pepperflower",
    "date": "2015-06-28"
  },
  {
    "text": "This is unique. No.19 smells different each time I try it. Mostly I like it for its green notes and crispness; understated elegance. But occasionally I dislike it as it's also got this bitter earthiness about it initially. The other day it reminded me of an old ashtray. Is the perfume 'off' or is it me? Judging by all the rave reviews of this classic, probably me....",
    "author": "Lucy Peach",
    "date": "2014-04-12"
  },
  {
    "text": "What a shame! Chanel how dare you to ask that much money for scented water in the nowadays version. Today i have tested this Chanel no19 at Ici Paris. It was the eau de parfum. Exactly after 10 minutes of applying the parfum was completely gone on my wrist. Nothing to smell. I have had the same experience with the nowadays version of no.5. In my opinion you can better buy a dupe of these parfums. They are much cheaper and probably much more long lasting. Chanel is probably thinking our name sells itself so we can weaken all the parfums more and more. I just can't believe such a marketing. Big big shame on you Chanel. 🤮The perfume blast in the beginning is very nice and very green thats all. Ten minutes of smell voor €150.",
    "author": "Dollycat",
    "date": "2025-08-10"
  }
]